{
  "code": 200,
  "count": 100,
  "news": [
    {
      "publisher": "Interesting Engineering",
      "title": "End of data decay? Microsoft’s ‘glass plates’ can store data for 10,000 years",
      "url": "https://interestingengineering.com/science/microsoft-project-silica-glass-data-storage",
      "desc": "Researchers at Microsoft have developed a method to store massive amounts of digital information inside...",
      "hash": "47ad39c23c44bba92190fb4be41eef2c",
      "triggerNames": [
        "experiments/trials/pilots",
        "research and publications"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_589",
        "KW_802"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Belper News",
      "title": "National Trust's country house in Derbyshire stars in Netflix’s Peaky Blinders: The Immortal Man",
      "url": "https://www.derbyshiretimes.co.uk/news/people/national-trusts-country-house-in-derbyshire-stars-in-netflixs-peaky-blinders-the-immortal-man-5604857",
      "desc": "The National Trust has confirmed that Calke Abbey, the ‘unstately home’ near Ticknall, plays a key role in the upcoming film Peaky Blinders The Immortal Man, which arrives in cinemas on March 6 and on Netflix on 20 March.",
      "hash": "91c738896ecb0bf958ac781d5822445f",
      "triggerNames": [
        "advertisement/branding/campaign"
      ],
      "companyNames": [
        "National Trust",
        "Netflix"
      ],
      "triggerCodes": [
        "KW_143"
      ],
      "companyDomains": [
        "nationaltrust.org.uk",
        "netflix.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Banbury Cake",
      "title": "The Spice Girls 'axe' reunion plans amid 'ongoing tensions'",
      "url": "https://www.oxfordmail.co.uk/news/25870187.spice-girls-axe-reunion-plans-amid-ongoing-tensions/?ref=rss",
      "desc": "The Spice Girls have reportedly axed plans for a Netflix reunion amid \"ongoing tensions\" between bandmates, including Geri Halliwell.",
      "hash": "b8539cf6dbaf5dcef1a519c1e14ebeca",
      "triggerNames": [
        "business shut-down"
      ],
      "companyNames": [
        "Netflix"
      ],
      "triggerCodes": [
        "KW_586"
      ],
      "companyDomains": [
        "netflix.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Yahoo Sports",
      "title": "Alejandro Balde: Man United’s plot to trump Inter Milan to Barca star",
      "url": "https://sports.yahoo.com/articles/alejandro-balde-man-united-plot-154000850.html",
      "desc": "Manchester United are reportedly ready to lock horns with Inter Milan in a red-hot race to sign Alejandro Balde – with INEOS prepared to table a big-money offer for the Spanish defender.Reinforcing ...",
      "hash": "cda392cb7d0eef3214ca9136ad70aea8",
      "triggerNames": [
        "investment",
        "customer acquisition/growth"
      ],
      "companyNames": [
        "Manchester United",
        "Inter Milan",
        "FC Barcelona"
      ],
      "triggerCodes": [
        "KW_556",
        "KW_708"
      ],
      "companyDomains": [
        "manutd.com",
        "inter.it",
        "fcbarcelona.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Metro.co.uk",
      "title": "The 10 hottest shows on Netflix this week as spy thriller tops the chart with 10,400,000 views",
      "url": "https://metro.co.uk/galleries/the-10-hottest-shows-on-netflix-this-week-as-spy-thriller-tops-the-chart-with-10400000-views-26993025/",
      "desc": "",
      "hash": "e32a82bb15158d0a84ea4c7b260d03b1",
      "triggerNames": [
        "business outlook & projections"
      ],
      "companyNames": [
        "Netflix"
      ],
      "triggerCodes": [
        "KW_688"
      ],
      "companyDomains": [
        "netflix.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "ComputerWeekly",
      "title": "IT Sustainability Think Tank: Counting the cost of AI datacentres and their energy use",
      "url": "https://www.computerweekly.com/opinion/IT-Sustainability-Think-Tank-Counting-the-cost-of-AI-datacentres-and-their-energy-use",
      "desc": "<p>The expansion of artificial intelligence (AI) datacentres has forced a long-overdue reckoning in the technology sector. What was once framed as an internal efficiency challenge for cloud providers has become a visible pressure on national energy systems, local communities (particularly in resource-stressed regions), and enterprise sustainability strategies.</p> \n<p>This is not a theoretical debate. Across the UK and other mature markets, AI datacentres are being fast-tracked through planning systems, prioritised for grid connections, and framed as strategic national assets.</p> \n<p>At the same time, governments are relying heavily on AI-enabled productivity gains to deliver economic and public-sector reform, <a href=\"https://www.techmarketview.com/ukhotviews-extra/archive/2025/09/17/the-31bn-question-is-britain-ready-for-its-ai-infrastructure-boom\">often without fully accounting for the infrastructure and energy trade-offs involved</a>.</p> \n<p><a href=\"https://www.computerweekly.com/news/366637333/Microsoft-urges-tech-rivals-to-cover-datacentre-expansion-related-power-costs-to-protect-consumers\">Microsoft’s recent call for a “community-first” approach to AI infrastructure</a> is therefore timely. It reflects burgeoning awareness amongst the hyperscalers that AI growth risks eroding public trust if they fail to address the technology’s energy and environmental impacts.</p> \n<p>But it also exposes a deeper issue: if AI infrastructure is now treated as strategic national capability – and <a href=\"https://www.techmarketview.com/research/archive/2025/07/22/sustainability-technology-activity-index-2025-global-market-shaping-trends\">subject to the same scrutiny as other forms of critical infrastructure</a> – then responsibility for its impacts can no longer sit with suppliers alone, nor be absorbed by the wider energy sector without debate.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"The real cost of AI infrastructure is no longer hidden\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>The real cost of AI infrastructure is no longer hidden<b> </b></h2>\n <p>For much of the past decade, cloud economics allowed energy consumption to be abstracted away from enterprise decision-making. Hyperscalers invested at scale, efficiencies improved, and sustainability narratives focused on relative gains versus on-premise infrastructure.</p>\n <p>AI changes that equation, because its workloads change the scale, timing, and concentration of energy demand. Unlike earlier waves of cloud adoption, AI infrastructure drives sustained high-intensity compute, exacerbates peak demand pressures, and accelerates the need for grid reinforcement and transmission upgrades.</p>\n <p>This is already visible in the prioritisation of <a href=\"https://www.computerweekly.com/news/366628066/The-UK-governments-AI-Growth-Zones-strategy-Everything-you-need-to-know\">AI Growth Zones</a> and datacentres for grid access <a href=\"https://www.techmarketview.com/research/archive/2026/02/05/accelerating-the-adoption-of-deep-and-emerging-tech-in-uk-energy\">(at a time when local electricity systems may already be under strain)</a>. Public investment in energy infrastructure has always underpinned economic development, and AI datacentres are increasingly framed as critical national infrastructure. However, once AI infrastructure becomes visible at this level, the question of who pays becomes unavoidable… and simply treating AI growth as a public good does not absolve private actors of responsibility.</p>\n <p>Hyperscalers do invest heavily in renewable energy procurement and efficiency (for instance, <a href=\"https://www.techmarketview.com/research/archive/2025/09/17/sustainability-technology-activity-index-2025-global-supplier-prospects\">AWS’s early achievement of renewable electricity matching targets and Microsoft’s investments in carbon removal and water stewardship</a>). Yet corporate-level commitments do not automatically extend to local grid upgrades, peak-load balancing, or network resilience costs; and the reporting of global averages can be used to hide local policy discrepancies.</p>\n <p>Credibility in climate and energy policy now depends less on ambition and more on implementation. Shifting costs off balance sheets does not make them disappear; it simply obscures who bears them.</p>\n <p>This challenge is intensified by diverging national policy regimes as well. In the US, AI infrastructure is now explicitly framed as a national security and economic priority, with environmental and planning constraints treated as barriers to acceleration. In the UK and Europe, however, AI growth is being layered onto energy systems already constrained by decarbonisation targets and public accountability.</p>\n <p>US-headquartered hyperscalers therefore operate across fundamentally different policy environments, with sustainability commitments that must travel across borders even when their home markets do not enforce equivalent constraints (a divergence that matters for UK suppliers, integrators, and enterprise buyers operating across global AI supply chains).</p>\n</section>        \n<section class=\"section main-article-chapter\" data-menu-title=\"Environmental responsibility cannot be outsourced to hyperscalers alone\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Environmental responsibility cannot be outsourced to hyperscalers alone</h2>\n <p>Decisions about model size, training frequency, workload placement, and operating schedules all materially affect energy consumption, and hyperscalers have responded with efficiency gains, renewable energy procurement, and public commitments to net-zero operations.</p>\n <p>However, focusing responsibility solely on big tech firms risks missing a deeper structural issue: whilst AI infrastructure is built by hyperscalers, its ultimate shape is determined by how enterprises choose to use it.</p>\n <p>Many organisations still treat AI as an abstract capability layered onto existing cloud contracts, rather than as a new class of infrastructure (one with distinct sustainability implications that encompass water usage and land constraints as well as energy supply). Some AI workloads are latency-sensitive and energy-intensive; others are batch-based and far more flexible. Some require GPUs running at full capacity; many do not. &nbsp;</p>\n <p>Decisions made by enterprise IT leaders about architecture, deployment models, and operating patterns directly influence energy consumption and environmental impact. Treating these dynamics as someone else’s problem is no longer tenable. In practice, this means that environmental responsibility must be shared across infrastructure providers, policymakers, and enterprise users.</p>\n <p>The environmental implications are even more pressing when the AI application in question is itself designed to <a href=\"https://www.techmarketview.com/research/archive/2024/11/08/managing-the-sustainable-ai-paradox\">enable system optimisation and energy efficiency</a>, as there must be a provable environmental net benefit to choosing a particular sustainability tech solution.</p>\n</section>      \n<section class=\"section main-article-chapter\" data-menu-title=\"Governance, not goodwill\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Governance, not goodwill</h2>\n <p>If AI datacentre growth is to be supported through public-private cost-sharing (whether for grid reinforcement, planning acceleration, or clean power generation), it must be governed explicitly.</p>\n <p>Without transparency, cost-sharing risks becoming cost-shifting – particularly in energy systems already under pressure <a href=\"https://www.techmarketview.com/research/archive/2026/02/05/accelerating-the-adoption-of-deep-and-emerging-tech-in-uk-energy\">(a risk amplified by the fragmented state of governance across the energy sector)</a>.</p>\n <p>The UK’s evolving approach to social value in public procurement offers a useful parallel. Over time, social value has moved from aspiration to measurable expectation, with suppliers required to demonstrate additionality rather than rely on generic corporate commitments.</p>\n <p>Sustainability commitments for AI infrastructure will need to follow a similar trajectory to prevent tech firms from hiding behind general global statements that fail to make a dent at the local level, where the environmental impacts of AI growth are being felt.</p>\n <p>Microsoft’s call to arms is notable not because it proposes a fully formed solution, but because it acknowledges that unmanaged AI infrastructure growth will create social backlash. From a policy perspective, this raises difficult trade-offs.</p>\n <p>Prioritising AI datacentres for grid connections may support economic growth (albeit with longer-term net effects as yet unproven), but it can also crowd out decarbonisation efforts. Funding grid reinforcement to support AI growth may be rational, but only if benefits are demonstrably shared rather than captured by the few.</p>\n <p>For enterprises, the implication is clear: energy responsibility will increasingly show up in procurement, regulation, and reporting expectations. Sustainability is no longer confined to corporate operations; it extends into the infrastructure choices embedded in digital transformation programmes.</p>\n</section>        \n<section class=\"section main-article-chapter\" data-menu-title=\"What enterprise IT leaders should be doing now\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>What enterprise IT leaders should be doing now</h2>\n <p>For CIOs and IT leaders, the question is not whether AI will increase energy and environmental pressure, but how to plan for it without undermining sustainability commitments. Three priorities stand out, all of which can be built into procurement criteria:</p>\n <ul class=\"default-list\"> \n  <li><b>Make AI workloads visible.</b> Many organisations lack granular insight into where AI workloads run, how energy-intensive they are, and how they interact with broader cloud consumption. Treating AI as “just another cloud service” is no longer sufficient. Integrated climate intelligence platforms, rather than siloed reporting tools, are thus becoming essential.</li> \n  <li><b>Treat architecture as a sustainability decision. </b>Choices around model size, training frequency, deployment location, and workload scheduling all have energy implications. In some cases, shifting workloads away from peak demand periods or consolidating models can materially reduce environmental impact without sacrificing business value.</li> \n  <li><b>Change the supplier conversation. </b>Enterprise buyers should demand greater transparency from hyperscalers and integrators around energy use, grid impact, and environmental trade-offs. Corporate net zero commitments alone are no longer sufficient proxies for responsible AI delivery; what matters is how AI services are delivered in practice.</li> \n </ul>\n <p>These steps do not absolve hyperscalers of responsibility, but they recognise that enterprise demand is a powerful lever too.</p>\n</section>    \n<section class=\"section main-article-chapter\" data-menu-title=\"A more honest conversation about AI growth\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>A more honest conversation about AI growth</h2>\n <p>The global race to scale AI infrastructure is now being shaped by policy regimes willing to trade environmental constraint for speed and dominance. In the US, that trade-off is explicit; in the UK, although it’s the government’s mission to ”make Britain a clean energy superpower”, the environmental consequences of AI are arriving regardless. AI workloads run on physical infrastructure, draw power from real grids, and impose costs that someone must absorb. Unexamined assumptions about where environmental impacts land are no longer acceptable; but neither is treating them as a purely technical issue, framed as an ethical failure of Big Tech alone.</p>\n <p>The constraint here is not technological capability, but coordination and governance <a href=\"https://www.techmarketview.com/research/archive/2026/02/05/accelerating-the-adoption-of-deep-and-emerging-tech-in-uk-energy\">(the same structural barriers shaping the UK’s clean energy transition more broadly)</a>. AI infrastructure is being layered onto a system already undergoing structural transformation, one in which further growth inevitably involves trade-offs.</p>\n <p>The uncomfortable reality is that AI growth creates costs that must be paid by someone. If those costs are hidden, deferred, or externalised, then trust in both technology and sustainability agendas will erode. If they are acknowledged, governed, and shared transparently, AI infrastructure can evolve in ways that support both long-term economic and environmental resilience.</p>\n <p>Microsoft’s call for a community-first approach should therefore be read less as reassurance, and more as a warning. In a world where AI growth is being actively accelerated by geopolitics, sustainability will not be delivered by intent alone. It will depend on who is prepared to insist on accountability – in procurement, in architecture, and in policy.</p>\n <p>For enterprise IT leaders, this means moving beyond simplistic narratives and acknowledging that AI ambition and sustainability credibility are now inseparable. The technology may be central to future productivity and growth, but intelligence at scale is not free. The question is no longer whether we can afford to power AI responsibly… it is whether we can afford not to.</p>\n <div class=\"extra-info\">\n  <div class=\"extra-info-inner\">\n   <h3 class=\"splash-heading\">Read more from the IT Sustainability Think Tank</h3> \n   <ul class=\"default-list\"> \n    <li><a href=\"https://www.computerweekly.com/opinion/IT-Sustainability-Think-Tank-AI-infrastructure-shared-responsibility-and-the-real-cost-of-progress\">When it comes to the environmental impacts of AI</a>, should big tech firms or enterprises, and their IT departments, be expected to “do their bit” to limit the potential environmental fallout of the technology's growing usage?</li> \n    <li><a href=\"https://www.computerweekly.com/opinion/IT-Sustainability-Think-Tank-How-IT-sustainability-entered-the-mandate-era-during-2025\">A year is a long time in tech, and the same is true of IT sustainability</a>. So here are some reflections on how the green IT conversation changed during 2025</li> \n   </ul>\n  </div>\n </div>\n</section>",
      "hash": "c6ab874655c40b9a4946df24dd16d9bf",
      "triggerNames": [
        "sustainability initiatives",
        "business expansion",
        "events & conferences"
      ],
      "companyNames": [
        "Microsoft",
        "Amazon Web Services (AWS)"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_702",
        "KW_649"
      ],
      "companyDomains": [
        "microsoft.com",
        "aws.amazon.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Tech Republic",
      "title": "Microsoft Denies ‘Mass Surveillance’ as ICE Triples Down on Azure Usage",
      "url": "https://www.techrepublic.com/article/news-ice-microsoft-azure-cloud-data-expansion/",
      "desc": "Leaked documents show that ICE more than tripled its Azure data storage in six months, even as Microsoft denied “mass surveillance” and urged lawmakers to set limits. The post Microsoft Denies ‘Mass Surveillance’ as ICE Triples Down on Azure Usage appeared first on TechRepublic .",
      "hash": "e5d246baadcd66bd4eb472a64cb7442c",
      "triggerNames": [
        "business expansion",
        "executive statement"
      ],
      "companyNames": [
        "Microsoft",
        "U.S. Immigration and Customs Enforcement (ICE)"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_583"
      ],
      "companyDomains": [
        "microsoft.com",
        "ice.gov"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Fast Company",
      "title": "At AI summit, Prime Minister Modi pitches India as global hub for artificial intelligence",
      "url": "https://www.fastcompany.com/91495285/ai-summit-prime-minister-modi-pitches-india-global-hub-artificial-intelligence?partner=rss&utm_source=rss&utm_medium=feed&utm_campaign=rss+fastcompany&utm_content=rss",
      "desc": "Indian Prime Minister Narendra Modi on Thursday pitched India as a central player in the global artificial intelligence ecosystem, saying the country aims to build technology at home while deploying it worldwide. “Design and develop in India. Deliver to the world. Deliver to humanity,” Modi told a gathering of some world leaders, technology executives and policymakers at the India AI Impact Summit in New Delhi. Modi’s remarks came as India — one of the fastest-growing digital markets — seeks to leverage its experience in building large-scale digital public infrastructure and to present itself as a cost-effective hub for AI innovation. The summit was also addressed by French President Emmanuel Macron, Google CEO Sundar Pichai and U.N. Secretary-General António Guterres, who called for a $3 billion fund to help poorer countries build basic AI capacity, including skills, data access and affordable computing power. “The future of AI cannot be decided by a handful of countries, or left to the whims of a few billionaires,” Guterres said, stressing that AI must “belong to everyone.” India aims to ramp up its AI scale India is using the summit to position itself as a bridge between advanced economies and the Global South. Indian officials cite the country’s digital ID and online payments systems as a model for deploying AI at low cost, particularly in developing countries. “We must democratize AI. It must become a tool for inclusion and empowerment, particularly for the Global South,” Modi said. With nearly 1 billion internet users, India has become a key market for global technology companies expanding their AI businesses. Last December, Microsoft announced a $17.5 billion investment over four years to expand cloud and AI infrastructure in India. It followed Google’s $15 billion investment over five years, including plans for its first AI hub in the country. Amazon has also pledged $35 billion by 2030, targeting AI-driven digitization. India is also seeking up to $200 billion in data center investment in the coming years. The country, however, lags in developing its own large-scale AI model like U.S.-based OpenAI or China’s DeepSeek, highlighting challenges such as limited access to advanced semiconductor chips, data centers and hundreds of local languages to learn from. The summit has faced troubles The summit opened Monday with organizational glitches, as attendees and exhibitors reported long lines and delays, and some complained on social media that personal belongings and display items had been stolen. Organizers later said the items were recovered. Problems resurfaced Wednesday when a private Indian university was expelled from the summit after a staff member showcased a commercially available Chinese-made robotic dog while claiming it as the institution’s own innovation. The setbacks continued Thursday when Microsoft co-founder Bill Gates withdrew from a scheduled keynote address. No reason was given, though the Gates Foundation said the move was intended “to ensure the focus remains on the AI Summit’s key priorities.” Gates is facing questions over his ties to late sex offender Jeffrey Epstein. —Associated Press",
      "hash": "21d7fb65db2c612d89b1fbd5b15e1f90",
      "triggerNames": [
        "events & conferences",
        "business expansion",
        "investment"
      ],
      "companyNames": [
        "Microsoft",
        "Google",
        "Amazon"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_708",
        "KW_649"
      ],
      "companyDomains": [
        "microsoft.com",
        "google.com",
        "amazon.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "EIN Newswire",
      "title": "Microsoft Restarts 810 MW North Carolina Data Center Build After Seven-Month Pause",
      "url": "https://www.einpresswire.com/article/893481109/microsoft-restarts-810-mw-north-carolina-data-center-build-after-seven-month-pause?ref=rss&code=ay6KrV-RakC3GahY",
      "desc": "After ~7 months of inactivity, Aterio's satellite monitoring detects simultaneous re-mobilization at Microsoft's three campuses in Catawba County, NC. VANCOUVER, BRITISH COLUMBIA, CANADA, February 19, 2026 /⁨EINPresswire.com⁩/ -- Aterio, a Data-as …",
      "hash": "a00679a70e3258d92e98e3f711b3cb7f",
      "triggerNames": [
        "project and operations status"
      ],
      "companyNames": [
        "Microsoft",
        "Aterio"
      ],
      "triggerCodes": [
        "KW_673"
      ],
      "companyDomains": [
        "microsoft.com",
        "aterio.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "ComputerWeekly",
      "title": "European politicians amplify disinformation about UN rapporteur",
      "url": "https://www.computerweekly.com/news/366639200/European-politicians-amplify-disinformation-about-UN-rapporteur",
      "desc": "<p>The amplification of disinformation about United Nations special rapporteur Francesca Albanese has prompted at least four European governments to call for her resignation over comments she never made.</p> \n<p>Responding to a deliberately truncated clip circulating online in which the special rapporteur for the human rights situation in Palestine ostensibly refers to Israel as “the common enemy of humanity”, leading politicians and diplomatic figures from France, Germany, Italy and the US sharply condemned Albanese, with many calling for her immediate resignation.</p> \n<p>This includes German foreign minister Johann Wadephul, who <a href=\"https://x.com/AussenMinDE/status/2021970644582207724\">called</a> her position “untenable”; French foreign minister Jean-Noel Barrot, who said France “unreservedly condemns the outrageous and reprehensible remarks” and called for her to step down; and Italian foreign minister Antonio Tajani, who <a href=\"https://x.com/Antonio_Tajani/status/2022019909690028427\">said</a> that her “behaviours…are not appropriate for the position she holds”.</p> \n<p>Other figures who have amplified the disinformation include the Czech Republic’s foreign minister Petr Macinka, who <a href=\"https://x.com/CzechMFA/status/2022212404705472685\">quoted Albanese on X</a> as having called Israel a “common enemy of humanity” and called for her resignation; and US ambassador Mike Waltz, who <a href=\"https://x.com/USAmbUN/status/2020613256566522095\">similarly quoted her saying the same</a> while accusing her of being an antisemite.</p> \n<p>Austrian foreign minister Beate Meinl-Reisinger went further, accusing Albanese of spreading hate speech and failing to meet the standards of impartiality expected of UN representatives.</p> \n<section class=\"section main-article-chapter\" data-menu-title=\"Actual remarks\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>Actual remarks</h2>\n <p>While Albanese was critical of Israel’s conduct in Gaza and the media reporting around it, in the remarks being referred to – made during a roundtable event in Doha organised by Al Jazeera, in which she spoke for roughly four minutes – the phrase is not directed at the state of Israel itself.</p>\n <p>“The fact that instead of stopping Israel, most of the world has armed, given Israel political excuses, political sheltering, economic and financial support. This is a challenge. The fact that most of the media in the Western world has been amplifying the pro-apartheid genocidal narrative is a challenge,” she said.</p>\n <p>“At the same time, here also lays the opportunity, because if international law has been stabbed in the heart, it’s also true that never before has the global community seen the challenges we all face.</p>\n <p>“We who do not control large amounts of financial capitals, algorithms and weapons, we now see that we as a humanity have a common enemy, and freedoms, the respect of fundamental freedoms is the last peaceful avenue, the last peaceful toolbox we have to regain our freedom.”</p>\n <p>Multiple media outlets, including <a href=\"https://www.reuters.com/world/middle-east/un-voices-concern-over-criticism-expert-palestinian-rights-2026-02-13/#:~:text=A%20transcript%20of%20Albanese%27s%20remarks%20made%20in%20Doha%20on%20February%207%20seen%20by%20Reuters%20did%20not%20characterise%20Israel%20in%20this%20way%2C%20although%20she%20has%20consistently%20criticised%20the%20country%20in%20the%20past%20over%20the%20Gaza%20conflict\">Reuters</a> and <a href=\"https://embed.france24.com/en/video/1609AD55-D8E0-41FF-AB6B-8140DC225FE9\">France24</a>, as well as the UN Human Rights Office, have all confirmed that the video being referred to is doctored, and that while Albanese was critical of Israel, she never made the remarks being falsely attributed to her.</p>\n <p>During a press conference, Marta Hurtado, spokesperson for the Office of the High Commissioner for Human Rights, for example, stated that Albanese “did not characterise any state as an enemy of humanity” and invited “all to go see her remarks”.</p>\n <p>Hurtado added Albanese was clearly referring to “broader systemic threats” to human rights, and that her office is “very worried” about escalating “personal attacks, threats and disinformation” targeting UN officials and independent experts.</p>\n <p>She further warned that such campaigns distract from “serious human rights issues,” including ongoing ceasefire violations being committed by the Israeli military on a daily basis.</p>\n <p>Despite being granted diplomatic immunity under her remit as a special rapporteur, Albanese was previously <a href=\"https://www.state.gov/releases/office-of-the-spokesperson/2025/07/sanctioning-lawfare-that-targets-u-s-and-israeli-persons\">sanctioned by the Trump administration in July 2025</a> – along with multiple members of the International Criminal Court (ICC) – after she sent “threatening letters” to a number of multinational companies, including from the US, that warned of their complicity in gross violations of international law. The sanctions mean that Albanese is unable to access any banks accounts or assets based in the US, and is unable to travel to the country.</p>\n <p>Albanese herself has rejected the accusations made against her, and clarified on&nbsp;<a href=\"https://x.com/FranceskAlbs/status/2020983308818186721\">social media</a> that “the common enemy of humanity is the system that has enabled the genocide in Palestine, including the financial capital that funds it, the algorithms that obscure it and the weapons that enable it”.</p>\n <p>She has also <a href=\"https://x.com/FranceskAlbs/status/2023366413570683310\">highlighted posts on X</a> that suggest the truncated clip was <a href=\"https://x.com/HillelNeuer/status/2020454512356376911\">initially shared online by Hillel Neuer, the executive director of UN Watch</a>, a pro-Israel non-governmental organisation that has <a href=\"https://unwatch.org/tag/francesca-albanese/\">repeatedly condemned Albanese since October 7</a> for being “antisemitic” and “pro-Hamas”.</p>\n <p>Commenting, Albanese said, “repeating a lie until it’s accepted – ‘illusory truth effect’– is a tactic long used by authoritarian regimes”, and that “A serious investigation is needed so the public sees what honest people have endured for decades”.</p>\n <p>Computer Weekly contacted UN Watch about the source of the clip and Neuer’s sharing of it, including whether he was aware it had been edited, but received no response.</p>\n <p>Reacting to the incident, Amnesty International secretary general Agnès Callamard said in a statement that the ministers must fully retract their calls for Albanese’s resignation. “It is reprehensible that ministers have attacked [Albanese] based on a deliberately truncated video to misrepresent and gravely misconstrue her messages – as is clear from watching her original address in its entirety,” she said.</p>\n <p>“The ministers that have spread disinformation must act beyond merely deleting their comments on social media – as some have done. They must publicly apologise and retract any calls for Francesca Albanese’s resignation. Their governments must also investigate how this disinformation happened with a view to preventing such situations.</p>\n <p>“If only these minsters had been as loud and forceful in confronting a state committing genocide, unlawful occupation and apartheid as they have in attacking a UN expert.”</p>\n <p>The France-based Association of Jurists for the Respect of International Law (Jurdi), comprised of practising international lawyers, <a href=\"https://www.middleeasteye.net/news/french-lawyers-seek-criminal-prosecution-foreign-minister-over-francesca-albanese-remarks\">said it has filed a criminal complaint against the French foreign minister Barrot</a>, claiming that his statements calling for Albanese’s resignation “may amount to the criminal offence provided for under French law relating to the dissemination of false information”.</p>\n <p>Computer Weekly contacted the office of every political figure that amplified the disinformation for comment, but only received a response from the German federal foreign office, which directed Computer Weekly to comments made during a government press conference on 13 February.</p>\n <p>“[Minister Wadephul] was referring to the statement as a whole, not to a manipulated video or other circulating statements…The point is that Ms. Albanese has repeatedly made statements and spread untenable falsehoods in the past, including about Germany,” said the department’s deputy spokesperson.</p>\n <p>“The German government has consistently rejected and criticised these statements. In connection with Israel, she spoke of a ‘common enemy’. Therefore, the entire context of the statement is what matters, regardless of how Ms. Albanese has subsequently explained it.”</p>\n <p>The Austrian foreign minister has since deleted her post on X accusing Albanese of spreading hate speech.</p>\n</section>                      \n<section class=\"section main-article-chapter\" data-menu-title=\"‘Economy of genocide’\">\n <h2 class=\"section-title\"><i class=\"icon\" data-icon=\"1\"></i>‘Economy of genocide’</h2>\n <p>As part of her mandate, Albanese has issued multiple reports since 7 October 2023 labelling Israel’s war on Gaza as a genocide, and denouncing the global economic and political systems that have supported its war.&nbsp;&nbsp;</p>\n <p>In June 2025, for example, <a href=\"https://www.computerweekly.com/news/366626968/Tech-firms-complicit-in-economy-of-genocide-says-UN-rapporteur\">Albanese published an investigative report</a> detailing “the role of corporate entities in sustaining the illegal Israeli occupation and its ongoing genocidal campaign in Gaza”.</p>\n <p>In particular, she highlighted how the “repression of Palestinians has become progressively automated” by the increasing supply of powerful military and surveillance technologies to Israel, including drones, artificial intelligence (AI)-powered targeting systems, cloud computing infrastructure, data analytics tools, biometric databases and high-tech weaponry.</p>\n <p>She said that if the companies supplying these technologies had conducted the proper&nbsp;<a href=\"https://www.computerweekly.com/news/366621892/Tech-sector-still-failing-to-rid-supply-chains-of-forced-labour\">human rights due diligence</a>&nbsp;– including IBM, Microsoft, Alphabet, Amazon and&nbsp;<a href=\"https://www.computerweekly.com/news/366626673/Silicon-Valley-execs-sworn-in-to-US-Army-reserves-specialist-unit\">Palantir</a>&nbsp;– they would have divested “long ago” from involvement in Israel’s&nbsp;<a href=\"https://news.un.org/en/story/2024/09/1154496\">illegal occupation</a>&nbsp;of Gaza and the West Bank.</p>\n <p>“After October 2023, long-standing systems of control, exploitation and dispossession metamorphosed into economic, technological and political infrastructures mobilised to inflict mass violence and immense destruction,” she said.</p>\n <p>Under international law, Albanese pointed out the mere fact that due diligence has been conducted does not absolve companies from legal liability over their role in abuses. Instead, the liability of companies is determined by both their actions and the ultimate human rights impact.</p>\n <div class=\"extra-info\">\n  <div class=\"extra-info-inner\">\n   <h3 class=\"splash-heading\">Read more about mis- and disinformation</h3> \n   <ul class=\"default-list\"> \n    <li><a href=\"https://www.computerweekly.com/feature/Misinformation-runs-deeper-than-social-media\">Misinformation runs deeper than social media</a>: While social media may contribute to the increasing rapid spread and reach of misinformation, the root causes of the problem go much deeper than the role of a particular company or way of using technology to communicate</li> \n    <li><a href=\"https://www.computerweekly.com/news/366618096/Davos-2025-Misinformation-and-disinformation-are-most-pressing-risk-says-World-Economic-Forum\">Davos 2025: Misinformation and disinformation are most pressing risks, says World Economic Forum</a>: World leaders, business chiefs and civil society organisations will discuss the risks posed by misinformation, disinformation and artificial intelligence at the World Economic Forum</li> \n    <li><a href=\"https://www.computerweekly.com/news/366626276/Traditional-fake-news-detection-fails-against-AI-generated-content\">Traditional fake news detection fails against AI-generated content</a>: As generative AI produces increasingly convincing text, Dutch researchers are exploring how linguistic cues, model bias and transparency tools can help detect fake news</li> \n   </ul>\n  </div>\n </div>\n</section>",
      "hash": "6d4aed5adac39c16034f9ca8b3637a01",
      "triggerNames": [
        "law suit/judgement/ settlement",
        "regulatory investigation",
        "regulatory ban & enforcement",
        "divestment",
        "research and publications",
        "scandals & frauds",
        "miscellaneous"
      ],
      "companyNames": [
        "United Nations",
        "IBM",
        "Microsoft",
        "Alphabet",
        "Amazon",
        "Palantir"
      ],
      "triggerCodes": [
        "KW_589",
        "KW_526",
        "KW_523",
        "KW_613",
        "KW_654",
        "KW_648",
        "KW_519"
      ],
      "companyDomains": [
        "un.org",
        "ibm.com",
        "microsoft.com",
        "abc.xyz",
        "amazon.com",
        "palantir.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Economic Times",
      "title": "India AI Impact Summit: Microsoft’s Brad Smith on Sovereignty, Scale and Skills",
      "url": "https://economictimes.indiatimes.com/news/videos/india-ai-impact-summit-microsofts-brad-smith-on-sovereignty-scale-and-skills/videoshow/128563984.cms",
      "desc": "",
      "hash": "b1732e587bb41fb95a3db0cf72e76bfc",
      "triggerNames": [
        "events & conferences",
        "executive statement"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Times of India",
      "title": "UK PM gives social media companies 48-hour deadline to remove these photos",
      "url": "https://timesofindia.indiatimes.com/technology/social/uk-pm-keir-starmer-gives-twitter-meta-tiktok-and-other-social-media-companies-a-48-hour-deadline-to-/articleshow/128468605.cms",
      "desc": "UK Prime Minister Keir Starmer has given social media giants 48 hours to remove non-consensual intimate images, warning of potential platform bans. This move follows concerns over AI tools like Grok generating explicit content.  Fines and blocking are possible penalties for non-compliance, shifting the burden from victims to companies.",
      "hash": "b26140fa9fa279e58532ea2108406790",
      "triggerNames": [
        "legislation & regulation",
        "regulatory ban & enforcement"
      ],
      "companyNames": [
        "Grok"
      ],
      "triggerCodes": [
        "KW_585",
        "KW_613"
      ],
      "companyDomains": [
        "x.ai"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "TechSpot",
      "title": "AI-generated passwords are surprisingly easy to crack, researchers find",
      "url": "https://www.techspot.com/news/111392-ai-generated-passwords-surprisingly-easy-crack-researchers-find.html",
      "desc": "Security firm Irregular analyzed outputs from tools such as Claude, ChatGPT, and Gemini, and found that many AI-generated passwords appear complex but are actually highly predictable and crackable. Read Entire Article",
      "hash": "9476e6f0c7bc978ea9dacc9aa4b14647",
      "triggerNames": [
        "research and publications",
        "security breach & vulnerability"
      ],
      "companyNames": [
        "Irregular",
        "Claude",
        "ChatGPT",
        "Gemini"
      ],
      "triggerCodes": [
        "KW_589",
        "KW_530"
      ],
      "companyDomains": [
        "irregular.io",
        "claude.ai",
        "openai.com",
        "deepmind.google"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Times of India",
      "title": "Kiku Sharda opens up about the decline in The Great Indian Kapil Show’s viewership; says ‘We are Transitioning’",
      "url": "https://timesofindia.indiatimes.com/tv/news/hindi/kiku-sharda-opens-up-about-the-decline-in-the-great-indian-kapil-shows-wiewership-says-we-are-transitioning/articleshow/128563679.cms",
      "desc": "Kiku Sharda addresses reports of declining viewership for 'The Great Indian Kapil Show' on Netflix. He believes the core style remains unchanged and attributes perceived differences to audience habit, noting the shift to weekly episodes. Sharda also praised his strong bond with Kapil Sharma, highlighting his genuine humor and respect.",
      "hash": "68e6f11dcd03327f6d3ea248763ad1c2",
      "triggerNames": [
        "customer loss/growth decline"
      ],
      "companyNames": [
        "Netflix"
      ],
      "triggerCodes": [
        "KW_647"
      ],
      "companyDomains": [
        "netflix.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Forbes",
      "title": "Rich And Powerful In The New Epstein Files: Ex-Prince Andrew Arrested For Misconduct",
      "url": "https://www.forbes.com/sites/alisondurkee/2026/02/10/rich-and-powerful-in-the-new-epstein-files-lutnick-admits-island-trip-wexner-received-100-million/",
      "desc": "The files include email exchanges with Elon Musk, Howard Lutnick and other billionaire associates.",
      "hash": "e7d2ced4436be705d0813d81445dd159",
      "triggerNames": [
        "scandals & frauds",
        "law suit/judgement/ settlement"
      ],
      "companyNames": [
        "Elon Musk",
        "Howard Lutnick"
      ],
      "triggerCodes": [
        "KW_526",
        "KW_654"
      ],
      "companyDomains": [
        "tesla.com",
        "cantor.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Techcrunch",
      "title": "OpenAI, Reliance partner to add AI search to JioHotstar",
      "url": "https://techcrunch.com/2026/02/19/openai-reliance-partner-to-add-ai-search-to-jiohotstar/",
      "desc": "The rollout includes two-way integration that surfaces streaming links directly inside ChatGPT.",
      "hash": "aa2d357dfd5b10976a02d55ef26472cc",
      "triggerNames": [
        "alliance & partnership",
        "new service launch"
      ],
      "companyNames": [
        "OpenAI",
        "Reliance"
      ],
      "triggerCodes": [
        "KW_512",
        "KW_566"
      ],
      "companyDomains": [
        "openai.com",
        "ril.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Livemint",
      "title": "AI costs are dropping fast—and India stands to gain: OpenAI CEO Sam Altman",
      "url": "https://www.livemint.com/ai/artificial-intelligence/sam-altman-openai-artificial-intelligence-costs-india-market-future-11771507738440.html",
      "desc": "OpenAI chief Sam Altman said falling computing and inference costs could make artificial intelligence widely accessible in India, even as he downplayed fears of disruption to the country’s IT services industry.",
      "hash": "c65a32fe938ef3bd93ed531a9496321c",
      "triggerNames": [
        "executive statement"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "YourStory",
      "title": "India fastest-growing market for OpenAI’s vibe coder Codex, Altman says",
      "url": "https://yourstory.com/2026/02/india-fastest-growing-market-for-openais-vibe-coder-codex-altman-says",
      "desc": "Addressing delegates at the IndiaAI Impact Summit, Altman pointed to rapid uptake in India as evidence of the country’s growing influence in shaping the next phase of AI deployment.",
      "hash": "0433c6c130d5bb83356e5f381c11aba5",
      "triggerNames": [
        "business expansion"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_527"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Times of India",
      "title": "Founder of OpenClaw hired by Sam Altman says that in Europe I am 'forever scolded' about…",
      "url": "https://timesofindia.indiatimes.com/technology/tech-news/founder-of-openclaw-hired-by-sam-altman-says-that-in-europe-i-am-forever-scolded-about/articleshow/128562125.cms",
      "desc": "Austrian AI developer Peter Steinberger is moving to OpenAI in San Francisco, citing a lack of enthusiasm and excessive regulation in Europe. He contrasts the 'enthusiastic' US environment with Europe's focus on 'regulation and responsibility,' which he believes stifles innovation and entrepreneurship. Steinberger's viral AI agent platform, OpenClaw, will remain open-source as he pursues ambitious goals with OpenAI.",
      "hash": "b4eabce3db8f654b15588e1c2e81f71b",
      "triggerNames": [
        "executive appointment",
        "business expansion"
      ],
      "companyNames": [
        "OpenAI",
        "OpenClaw"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_591"
      ],
      "companyDomains": [
        "openai.com",
        "openclaw.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Times of India",
      "title": "Microsoft Azure powers Shriram Finance's super app that serves 20 million users across India",
      "url": "https://timesofindia.indiatimes.com/technology/tech-news/microsoft-azure-powers-shriram-finances-super-app-that-serves-20-million-users-across-india/articleshow/128562422.cms",
      "desc": "Shriram Finance's cloud-native app, Shriram One, built on Microsoft Azure, is revolutionizing financial access for rural India, with 63% of its 20 million users hailing from smaller towns. This super app, offering lending, deposits, insurance, and payments, has seen fixed deposit volumes surge threefold.  Microsoft's robust infrastructure ensures seamless operations and enhanced security, empowering millions with digital financial tools.",
      "hash": "410909f4f2545231760dd77ae33f0ccf",
      "triggerNames": [
        "alliance & partnership",
        "business expansion",
        "customer acquisition/growth",
        "new product launch"
      ],
      "companyNames": [
        "Shriram Finance",
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_556",
        "KW_512",
        "KW_521"
      ],
      "companyDomains": [
        "shriramfinance.in",
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Latestly",
      "title": "World News | At AI India Summit: Friends-turned-foes Altman, Amodei's Clenched Fists Photo Fuels Rivalry Narrative",
      "url": "https://www.latestly.com/agency-news/world-news-at-ai-india-summit-friends-turned-foes-altman-amodeis-clenched-fists-photo-fuels-rivalry-narrative-7321204.html",
      "desc": "Get latest articles and stories on World at LatestLY.  In 2021, Amodei left OpenAI over reported disagreements and soon after, co-founded Anthropic, positioning it as a safety-focused alternative in the AI race.",
      "hash": "9886fba4288f3345e1ed4d9e8a825bca",
      "triggerNames": [
        "executive change",
        "new initiatives and programs"
      ],
      "companyNames": [
        "OpenAI",
        "Anthropic"
      ],
      "triggerCodes": [
        "KW_502",
        "KW_801"
      ],
      "companyDomains": [
        "openai.com",
        "anthropic.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "FinSME",
      "title": "xAI Raises $3 Billion in Series E Funding",
      "url": "https://www.finsmes.com/2026/02/xai-raises-3-billion-in-series-e-funding.html",
      "desc": "xAI, a San Francisco, CA-based developer of frontier artificial intelligence, raised $3 billion in Series E funding",
      "hash": "88a140142047d147fe129cddd68de9de",
      "triggerNames": [
        "fundraising"
      ],
      "companyNames": [
        "xAI"
      ],
      "triggerCodes": [
        "KW_514"
      ],
      "companyDomains": [
        "x.ai"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Electrek",
      "title": "Tesla admits it still needs drivers and remote operators — then argues that’s better than Waymo",
      "url": "https://electrek.co/2026/02/19/tesla-admits-needs-drivers-and-remote-operators-argues-better-than-waymo/",
      "desc": "Tesla filed new comments with the California Public Utilities Commission that amount to a quiet admission: its “Robotaxi” service still relies on both in-car human drivers and domestic remote operators to function. Rather than downplaying these dependencies, Tesla leans into them — arguing that its multi-layered human supervision model is more reliable than Waymo’s fully driverless system, pointing to the December 2025 San Francisco blackout as proof. The filing, submitted February 13 in CPUC Rulemaking 25-08-013, reveals the massive operational gap between what Tesla calls a “Robotaxi” and what Waymo actually operates as one. more…",
      "hash": "af14a85dd64efe67d57bea1e42edd11b",
      "triggerNames": [
        "regulatory filing",
        "executive statement"
      ],
      "companyNames": [
        "Tesla",
        "Waymo"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_593"
      ],
      "companyDomains": [
        "tesla.com",
        "waymo.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "PR Newswire",
      "title": "Norm Ai and Microsoft: Legal & Compliance AI Built for the Way Work Actually Happens",
      "url": "https://www.prnewswire.com/news-releases/norm-ai-and-microsoft-legal--compliance-ai-built-for-the-way-work-actually-happens-302692324.html",
      "desc": "Turn legal & compliance complexity into scalable, defensible workflows inside the Microsoft enterprise ecosystem, available through the Microsoft Marketplace NEW YORK, Feb. 19, 2026 /PRNewswire/ -- As enterprises adopt AI across their organizations, the volume and speed of work continues...",
      "hash": "a794f7cfb7779fb83fa0f0207fbb6dc7",
      "triggerNames": [
        "alliance & partnership",
        "new service launch"
      ],
      "companyNames": [
        "Norm Ai",
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_512",
        "KW_566"
      ],
      "companyDomains": [
        "norm.ai",
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Media Post",
      "title": "Netflix Global Ad Prospects: Growing Non-English Content?",
      "url": "https://www.mediapost.com/publications/article/412863/",
      "desc": "For the first time, non-English-language original titles made up the majority of Netflix's original TV releases - at 52%.",
      "hash": "30858bf0fdab0d30a10d3beb09c2d22c",
      "triggerNames": [
        "business outlook & projections"
      ],
      "companyNames": [
        "Netflix"
      ],
      "triggerCodes": [
        "KW_688"
      ],
      "companyDomains": [
        "netflix.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Times of India",
      "title": "UK PM Keir Starmer gives Twitter, Meta, TikTok and other social media companies 48-hour deadline to …",
      "url": "https://timesofindia.indiatimes.com/technology/social/uk-pm-keir-starmer-gives-twitter-meta-tiktok-and-other-social-media-companies-a-48-hour-deadline-to-/articleshow/128468605.cms",
      "desc": "UK Prime Minister Keir Starmer has given social media giants 48 hours to remove non-consensual intimate images, warning of potential platform bans. This move follows concerns over AI tools like Grok generating explicit content.  Fines and blocking are possible penalties for non-compliance, shifting the burden from victims to companies.",
      "hash": "42b5e96a84ff4e63f7b856a6d7a9982e",
      "triggerNames": [
        "regulatory ban & enforcement",
        "legislation & regulation"
      ],
      "companyNames": [
        "Twitter",
        "Meta",
        "TikTok"
      ],
      "triggerCodes": [
        "KW_585",
        "KW_613"
      ],
      "companyDomains": [
        "twitter.com",
        "meta.com",
        "tiktok.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Tech Radar",
      "title": "Microsoft's ROG Xbox Ally X just saw price hikes in Australia and Japan  — I'm willing to bet that other regions are next",
      "url": "https://www.techradar.com/gaming/xbox/microsofts-rog-xbox-ally-x-just-saw-price-hikes-in-australia-and-japan-im-willing-to-bet-that-other-regions-are-next",
      "desc": "Microsoft's ROG Xbox Ally X handheld may be the latest victim hit by the ongoing RAM crisis, after price increases in Japan and Australia.",
      "hash": "892026ac4bc66214b65e6f1f6983df1c",
      "triggerNames": [
        "pricing"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_14"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Fox News",
      "title": "AI home search could change how you buy a house",
      "url": "https://www.foxnews.com/tech/ai-home-search-could-change-how-you-buy-house",
      "desc": "Homes.com launched Homes AI powered by Microsoft Azure OpenAI, enabling conversational home search where buyers describe preferences in plain language.",
      "hash": "be3d6e39d62d5b7f6d70871b4ba9dcf0",
      "triggerNames": [
        "new product launch",
        "alliance & partnership"
      ],
      "companyNames": [
        "Homes.com",
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_512",
        "KW_521"
      ],
      "companyDomains": [
        "homes.com",
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Forbes",
      "title": "See Sam Altman’s Awkward Moment With Anthropic’s CEO At India’s AI Summit—As Bill Gates Drops Out Amid Epstein Scrutiny",
      "url": "https://www.forbes.com/sites/siladityaray/2026/02/19/see-sam-altmans-awkward-moment-with-anthropics-ceo-at-indias-ai-summit-as-bill-gates-drops-out-amid-epstein-scrutiny/",
      "desc": "Amodei and Altman’s company have recently sniped at each other over OpenAI’s introduction of ads within its products.",
      "hash": "ebc77326e2e2828fbd1c5bdee7f30e8f",
      "triggerNames": [
        "events & conferences",
        "executive statement"
      ],
      "companyNames": [
        "OpenAI",
        "Anthropic"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com",
        "anthropic.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "NDTV",
      "title": "Chatha Pacha Begins Streaming on Netflix, Mammootty's Cameo Back In The Spotlight",
      "url": "https://www.ndtvprofit.com/lifestyle/chatha-pacha-begins-streaming-on-netflix-mammootty-s-cameo-back-in-the-spotlight-11070971#publisher=newsstand",
      "desc": "This sports drama reportedly collected around Rs 31 crore worldwide in 2026, emerging as an average performer at the box office.",
      "hash": "5695be9fdd5dfe2ca703a0b1807f6934",
      "triggerNames": [
        "new service launch"
      ],
      "companyNames": [
        "Netflix"
      ],
      "triggerCodes": [
        "KW_566"
      ],
      "companyDomains": [
        "netflix.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Economic Times",
      "title": "OpenAI CEO Sam Altman defends AI use of news content",
      "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/openai-ceo-sam-altman-defends-ai-use-of-news-content/articleshow/128560254.cms",
      "desc": "Sam Altman, chief executive officer of OpenAI, on Thursday defended use of copyright news articles and opinion pieces in training AI models like ChatGPT, saying it followed the US principle of fair use.",
      "hash": "b8491d5feb237cf8e19253b4b213feb9",
      "triggerNames": [
        "executive statement",
        "copyright/patent/trademark - infringement/dispute"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_711"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Business Wire",
      "title": "RingCentral Drives New Era of Enterprise Voice AI Performance with OpenAI",
      "url": "http://www.businesswire.com/news/home/20260219247313/en/RingCentral-Drives-New-Era-of-Enterprise-Voice-AI-Performance-with-OpenAI/?feedref=JjAwJuNHiystnCoBq_hl-fqXyBvmekC3Xq1G1wQ7hjMFbZM1ntlKeK-8bUzJqFSVSfe41V1BKA-b6v2ZVrSSNs-dUYKiDvY7XniNSqv88QcY1Ge_vf9QIMZ4alzIf_0HlyE0C4hZhHVlTvKnn0d0vQ==",
      "desc": "BELMONT, Calif.--(BUSINESS WIRE)---- $rng #AI--RingCentral is integrating OpenAI to advance enterprise-grade voice AI.",
      "hash": "c4ecb44f17f70990b6ac61d9543073d5",
      "triggerNames": [
        "alliance & partnership",
        "new product launch"
      ],
      "companyNames": [
        "RingCentral",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_512",
        "KW_521"
      ],
      "companyDomains": [
        "ringcentral.com",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "NDTV",
      "title": "Manchester United Co-Onwer Avram Glazer Bids For RCB",
      "url": "https://www.ndtvprofit.com/sports/manchester-united-co-onwer-avram-glazer-bids-for-rcb-11071610#publisher=newsstand",
      "desc": "Avram Glazer",
      "hash": "538b62ec797af1ace83e2e0effef49e4",
      "triggerNames": [
        "auctions & bids",
        "investment"
      ],
      "companyNames": [
        "Manchester United",
        "Royal Challengers Bangalore (RCB)"
      ],
      "triggerCodes": [
        "KW_708",
        "KW_676"
      ],
      "companyDomains": [
        "manutd.com",
        "royalchallengers.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "PR Newswire",
      "title": "GLOBAL OVARIAN CANCER RESEARCH CONSORTIUM AWARDS INAUGURAL AI ACCELERATOR GRANT WITH MICROSOFT'S AI FOR GOOD LAB",
      "url": "https://www.prnewswire.com/news-releases/global-ovarian-cancer-research-consortium-awards-inaugural-ai-accelerator-grant-with-microsofts-ai-for-good-lab-302692213.html",
      "desc": "$1 million global research award, plus $1 million in compute support, advances AI-driven efforts to personalize ovarian cancer care NEW YORK, Feb. 19, 2026 /PRNewswire/ -- The Global Ovarian Cancer Research Consortium awarded its inaugural AI Accelerator Grant to an international research...",
      "hash": "decae4b33c767a421b61361ed38ce7e0",
      "triggerNames": [
        "awards & recognition",
        "donation & sponsorship"
      ],
      "companyNames": [
        "Global Ovarian Cancer Research Consortium",
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_592",
        "KW_532"
      ],
      "companyDomains": [
        "ovariancancerconsortium.org",
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Dataquest",
      "title": "By 2028, Intelligence May Shift to Data Centres: Altman Warns Against Concentrated Power",
      "url": "https://www.dqindia.com/news/by-2028-intelligence-may-shift-to-data-centres-altman-warns-against-concentrated-power-11133978",
      "desc": "At the AI Impact Summit 2026, Sam Altman, CEO of OpenAI, went beyond predicting the arrival of superintelligence. He framed the coming years as a defining test for democracy, governance, and global power. “If our predictions hold, by the end of 2028 more of the world’s intellectual capacity could exist inside data centres than outside them,” Altman said. “We could be wrong, but it bears serious consideration.” That projection anchored his central warning: the future of artificial intelligence will be shaped not just by capability, but by who controls it. India’s Role in a Democratic AI Order Altman opened by pointing to India’s rapid AI adoption. More than 100 million people in the country now use ChatGPT weekly, with students accounting for over a third of users. India has also become the fastest-growing market for Codex, OpenAI’s coding agent. “It is striking how much progress India has made in its mission to put AI to work for more people,” he said. He positioned India as uniquely placed to influence global AI norms. As the world’s largest democracy, India has the opportunity to build AI at scale while shaping how it is governed. Advances in sovereign AI infrastructure and small language models, he argued, signal that India is actively shaping the technology rather than merely consuming it. Altman suggested that if intelligence increasingly resides in data centres, democratic countries like India will play a critical role in determining whether that power is distributed or centralised. Superintelligence, Democratisation and Safety Altman offered one of his strongest forecasts yet, suggesting that early forms of true superintelligence could emerge within two years. Such systems, he said, could outperform top executives and leading scientists. “At some point on its development curve, a superintelligence would be able to do a better job being the CEO of a major company than any executive; certainly me, or conduct better research than our best scientists.” He traced the rapid acceleration of AI capabilities, from struggling with high-school mathematics to handling research-level problems in just a few years. While progress remains unpredictable, the pace suggests the next leap may arrive sooner than expected. Democratisation, Altman argued, is not just a moral choice but a safety strategy. Concentrating AI power within a single company or country increases systemic risk. “Democratisation of AI is the only fair and safe path forward,” he said, rejecting the idea that society must trade freedom for breakthroughs. “Some people want effective totalitarianism in exchange for a cure for cancer. I don’t think we should accept that trade-off.” He warned that safety cannot be solved inside AI labs alone. Risks range from misuse of powerful open-source biomodels to new forms of conflict enabled by AI. Addressing them will require governments, institutions, and civil society to work together. Economic Disruption and Long-Term Implications Altman acknowledged that rapid AI progress will reshape economies. As systems improve, the cost of many goods and services, from healthcare and education to manufacturing, could fall sharply. At the same time, labour disruption is inevitable. “It will be very hard to outwork a GPU in many ways,” he said, while noting that humans retain advantages in empathy, judgement, and social connection. Placing disruption in historical context, Altman argued that each generation inherits a more powerful technological foundation. The responsibility today, he said, is to ensure that future generations benefit from AI’s upside rather than bear the cost of concentrated power. He closed with a clear warning. The coming years will force a choice. “As this technology continues to improve rapidly, we can either empower people or concentrate power.” Altman called for international coordination, potentially through institutions similar to the IAEA, to oversee advanced AI systems and respond quickly to emerging risks. If intelligence increasingly resides in data centres, the defining question will not be how smart machines become, but whether they expand human freedom or entrench centralised control. The technology is moving fast; the political and ethical decisions must keep pace.",
      "hash": "e0a74e7a08b565be07148df7e28e20b9",
      "triggerNames": [
        "events & conferences",
        "executive statement",
        "business outlook & projections",
        "new initiatives and programs"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_688",
        "KW_649",
        "KW_801"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Economic Times",
      "title": "RCB ownership battle heats up as Man United's Glazer said to have bid $1.8 billion",
      "url": "https://economictimes.indiatimes.com/news/sports/rcb-ownership-battle-heats-up-as-man-uniteds-glazer-said-to-have-bid-1-8-billion/articleshow/128557721.cms",
      "desc": "Manchester United co-owner Avram Glazer is reportedly making a bid for the Royal Challengers Bengaluru cricket team. The offer is around $1.8 billion. Other potential buyers include Blackstone, Carlyle, and Indian tycoons. Diageo, the current owner, is seeking to sell part or all of the franchise. The Glazer family has previously shown interest in cricket investments.",
      "hash": "7959eea865b4e0360d8026484afbe1cd",
      "triggerNames": [
        "divestment",
        "buyout",
        "merger & acquisition"
      ],
      "companyNames": [
        "Royal Challengers Bengaluru",
        "Manchester United",
        "Diageo"
      ],
      "triggerCodes": [
        "KW_535",
        "KW_518",
        "KW_519"
      ],
      "companyDomains": [
        "royalchallengers.com",
        "manutd.com",
        "diageo.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Times of India",
      "title": "What OpenAI CEO said about awkward moment with Anthropic CEO at India AI Summit going viral",
      "url": "https://timesofindia.indiatimes.com/technology/tech-news/openai-ceo-sam-altman-on-awkward-moment-with-anthropic-ceo-dario-amodei-at-india-ai-summit-going-viral-says-i-was-sort-of-/articleshow/128556462.cms",
      "desc": "OpenAI CEO Sam Altman addressed an awkward onstage moment at the India AI Impact Summit 2026, where he and Anthropic CEO Dario Amodei appeared to hesitate during a group photo with Prime Minister Narendra Modi. Altman stated he was confused about the expected pose, mistaking it for an 'open clock' gesture.",
      "hash": "085ffa7398cefb108a7540d7e8589f2b",
      "triggerNames": [
        "executive statement",
        "events & conferences"
      ],
      "companyNames": [
        "OpenAI",
        "Anthropic"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com",
        "anthropic.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "0e5d93e8b933700c2ff78623feb4335f",
          "title": "What OpenAI CEO said about awkward moment with Anthropic CEO at India AI Summit",
          "desc": "OpenAI CEO Sam Altman addressed an awkward onstage moment at the India AI Impact Summit 2026, where he and Anthropic CEO Dario Amodei appeared to hesitate during a group photo with Prime Minister Narendra Modi. Altman stated he was confused about the expected pose, mistaking it for an 'open clock' gesture.",
          "publisher": "The Times of India",
          "url": "https://timesofindia.indiatimes.com/technology/tech-news/openai-ceo-sam-altman-on-awkward-moment-with-anthropic-ceo-dario-amodei-at-india-ai-summit-going-viral-says-i-was-sort-of-/articleshow/128556462.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "The Times",
      "title": "Get behind tech giants’ investment plans, Ackman urges investors",
      "url": "https://www.thetimes.com/business/companies-markets/article/bill-ackman-tech-giants-ai-investment-plans-wkmh20kl8",
      "desc": "Bill Ackman, manager of Pershing Square Holdings, is a relatively late convert but now expects the AI plans of Amazon, Meta and Alphabet to boost valuations",
      "hash": "46aa58ac3026f0995145451d151468cf",
      "triggerNames": [
        "investment",
        "business outlook & projections"
      ],
      "companyNames": [
        "Amazon",
        "Meta",
        "Alphabet",
        "Pershing Square Holdings"
      ],
      "triggerCodes": [
        "KW_688",
        "KW_708"
      ],
      "companyDomains": [
        "amazon.com",
        "meta.com",
        "abc.xyz",
        "pershingsquareholdings.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "BBC News",
      "title": "Woman accused of using ChatGPT to plan drug murders",
      "url": "https://www.bbc.com/news/articles/clyv80e5dljo?at_medium=RSS&at_campaign=rss",
      "desc": "The 21-year-old woman is accused by authorities in South Korea of secretly administering drinks containing drugs to three men in their 20s.",
      "hash": "24a2be97bc6ffcdc12969bd19d033960",
      "triggerNames": [
        "scandals & frauds"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_654"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Minneapolis Star Tribune",
      "title": "‘Digital co-worker’ on the rise in health care and other insights from Medical Alley’s 2026 Summit",
      "url": "https://www.startribune.com/north-star-insider-digital-coworker-ai-healthcare-medical-alley-summit/601584341",
      "desc": "Plus: Target doubles down on OpenAI partnership.",
      "hash": "e3295e8167370f54fc2c407f86904188",
      "triggerNames": [
        "events & conferences",
        "alliance & partnership"
      ],
      "companyNames": [
        "Medical Alley",
        "Target Corporation",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_649",
        "KW_512"
      ],
      "companyDomains": [
        "medicalalley.org",
        "corporate.target.com",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Economic Times",
      "title": "Didn't know what I was supposed to do: Sam Altman on awkward moment with Anthropic's Dario Amodei",
      "url": "https://economictimes.indiatimes.com/tech/technology/didnt-know-what-i-was-supposed-to-do-sam-altman-on-awkward-moment-with-anthropics-dario-amodei/articleshow/128556917.cms",
      "desc": "The Prime Minister was at the centre with Pichai on his right and Altman on his left. Amodei, who previously worked at OpenAI but eventually left to co-found Anthropic, was standing next to Altman.",
      "hash": "c9c2ccf48168f634ec32c3ede8a57cd1",
      "triggerNames": [
        "executive statement"
      ],
      "companyNames": [
        "OpenAI",
        "Anthropic",
        "Google"
      ],
      "triggerCodes": [
        "KW_583"
      ],
      "companyDomains": [
        "openai.com",
        "anthropic.com",
        "google.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Bloomberg Technology",
      "title": "Altman Warns About Dictators Using AI, Oil Rises on Iran Concerns | The Opening Trade 2/19/2026",
      "url": "https://www.bloomberg.com/news/videos/2026-02-19/the-opening-trade-2-19-2026-video",
      "desc": "OpenAI CEO Sam Altman discusses the democratization of AI, saying we should remain 'humble' about what we still don’t know about superintelligence. He pointed to the uncertainty around how the technology could be used by totalitarian governments while speaking at India's AI summit.\n\nOil steadied after its biggest daily gain since October, following a report that American military intervention in Iran could come sooner than expected. Brent held above $70 a barrel after adding 4.3% on Wednesday, while West Texas Intermediate traded above $65. (Source: Bloomberg)",
      "hash": "f3a753f8f6925d753c357dfaf8af5728",
      "triggerNames": [
        "executive statement",
        "events & conferences"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Newsweek",
      "title": "'The Night Agent' Creator Reveals Season 4 Status Amid Renewal Speculations",
      "url": "https://www.newsweek.com/entertainment/night-agent-creator-reveals-season-4-renewal-status-11546524",
      "desc": "\"The Night Agent\" creator Shawn Ryan has spoken about Season 4 of the hit Netflix show.",
      "hash": "de6a29b3f567a851fecedc3484fec94d",
      "triggerNames": [
        "business outlook & projections"
      ],
      "companyNames": [
        "Netflix"
      ],
      "triggerCodes": [
        "KW_688"
      ],
      "companyDomains": [
        "netflix.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Economic Times",
      "title": "India AI Summit: Microsoft president outlines promise and responsibility of AI for Global South",
      "url": "https://economictimes.indiatimes.com/ai/ai-insights/india-ai-summit-microsoft-president-outlines-promise-and-responsibility-of-ai-for-global-south/articleshow/128555922.cms",
      "desc": "A recent diffusion report by Microsoft points to a widening AI adoption gap between advanced and developing economies. Adoption rates in the Global North stand at about 25%, compared with roughly 14% in the Global South. India performs slightly better, with adoption at more than 15%, though it remains closer to the Global South average.",
      "hash": "2908c2646cc48edfe8ec48f946cdb97f",
      "triggerNames": [
        "events & conferences",
        "research and publications"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_589",
        "KW_649"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Information",
      "title": "Netflix Sends Legal Letter to ByteDance Over AI Videos",
      "url": "https://www.theinformation.com/briefings/netflix-sends-legal-letter-bytedance-ai-videos",
      "desc": "Netflix sent a cease-and-desist letter demanding that ByteDance take immediate steps to prevent its AI video generation model, Seedance 2.0, from producing content that resembles the U.S. streaming giant’s characters, titles or settings, according to Deadline. Since the Chinese tech giant ...",
      "hash": "22ee97342358d824a98613117490a783",
      "triggerNames": [
        "law suit/judgement/ settlement",
        "copyright/patent/trademark - infringement/dispute"
      ],
      "companyNames": [
        "Netflix",
        "ByteDance"
      ],
      "triggerCodes": [
        "KW_526",
        "KW_711"
      ],
      "companyDomains": [
        "netflix.com",
        "bytedance.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Forbes",
      "title": "Why Microsoft And Amazon Are Turning To Nuclear Power For AI",
      "url": "https://www.forbes.com/sites/rrapier/2026/02/19/why-microsoft-and-amazon-are-turning-to-nuclear-power-for-ai/",
      "desc": "AI’s soaring energy demand is pushing Microsoft and Amazon toward nuclear power, reshaping data center strategy, electricity markets, and the future of baseload energy.",
      "hash": "50155039e0c13f9baf9e9bacfb7b49d3",
      "triggerNames": [
        "business expansion",
        "new initiatives and programs",
        "sustainability initiatives"
      ],
      "companyNames": [
        "Microsoft",
        "Amazon"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_702",
        "KW_801"
      ],
      "companyDomains": [
        "microsoft.com",
        "amazon.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Hindu Business Line",
      "title": "Altman and Modei’s tense hand-hold: A photo-op that captured AI’s defining rivalry",
      "url": "https://www.thehindubusinessline.com/news/altman-and-modeis-tense-hand-hold-a-photo-op-that-captured-ais-defining-rivalry/article70651415.ece",
      "desc": "In the past, Altman and Amodei have taken a jibe at each other, after Anthropic aired a Super Bowl campaign in the US that appeared to mock OpenAI’s move to introduce ads in ChatGPT",
      "hash": "ef4bd27aa695ee9be0e2366544772a52",
      "triggerNames": [
        "advertisement/branding/campaign"
      ],
      "companyNames": [
        "OpenAI",
        "Anthropic"
      ],
      "triggerCodes": [
        "KW_143"
      ],
      "companyDomains": [
        "openai.com",
        "anthropic.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "0a56a36f9c56f244d8ed8c6d42b49e78",
          "title": "Altman and Amodei’s tense hand-hold: A photo-op that captured AI’s defining rivalry",
          "desc": "In the past, Altman and Amodei have taken a jibe at each other, after Anthropic aired a Super Bowl campaign in the US that appeared to mock OpenAI’s move to introduce ads in ChatGPT",
          "publisher": "The Hindu Business Line",
          "url": "https://www.thehindubusinessline.com/info-tech/altman-and-amodeis-tense-hand-hold-a-photo-op-that-captured-ais-defining-rivalry/article70651415.ece",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "9cccdd3a11a597973059ad806b289ce8",
          "title": "Altman and Amodei’s tense handshake: A photo-op that captured AI’s defining rivalry",
          "desc": "In the past, Altman and Amodei have taken a jibe at each other, after Anthropic aired a Super Bowl campaign in the US that appeared to mock OpenAI’s move to introduce ads in ChatGPT",
          "publisher": "The Hindu Business Line",
          "url": "https://www.thehindubusinessline.com/info-tech/altman-and-amodeis-tense-hand-hold-a-photo-op-that-captured-ais-defining-rivalry/article70651415.ece",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "CNBC",
      "title": "Watch CNBC's full interview with OpenAI CEO Sam Altman from the India AI Summit",
      "url": "https://www.cnbc.com/video/2026/02/19/openai-sam-altman-india-ai-summit-full-interview.html",
      "desc": "OpenAI CEO Sam Altman discusses AI infrastructure, OpenAI's business model, competition from China and thoughts on the industry from the India AI Impact Summit.",
      "hash": "130a326f73d40c003981089ce76b31fc",
      "triggerNames": [
        "executive statement",
        "events & conferences"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Interesting Engineering",
      "title": "Tesla radio tech wins key US approval for wireless charging of Cybercab EV outdoors",
      "url": "https://interestingengineering.com/transportation/tesla-wins-us-approval-for-wireless-ev-charging",
      "desc": "Tesla has secured a key regulatory win as it prepares to roll out its purpose-built...",
      "hash": "d9b27ea0934afc88979926b63baf5982",
      "triggerNames": [
        "regulatory approval",
        "new product launch"
      ],
      "companyNames": [
        "Tesla"
      ],
      "triggerCodes": [
        "KW_522",
        "KW_521"
      ],
      "companyDomains": [
        "tesla.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Big News Network",
      "title": "Vishal Sikka clarifies 2015 proposed investment in OpenAI amid missed opportunity debate",
      "url": "http://bignewsnetwork.com/news/278876966/vishal-sikka-clarifies-2015-proposed-investment-in-openai-amid-missed-opportunity-debate",
      "desc": "By Sahil Pandey New Delhi [India], February 19 (ANI): Former Infosys CEO and founder & CEO Vianai systems ,Vishal Sikka on Thursday addressed the questions about an early association with OpenAI, clarifying that the engagement was philanthropic in nature. Responding to a query of ANI, on whether an investment made in 2016 could have multiplied significantly in value, Sikka said, 'We did give a donation",
      "hash": "a82a30c36ed51dd24156bc44d46c44b0",
      "triggerNames": [
        "donation & sponsorship",
        "rumor & speculation"
      ],
      "companyNames": [
        "Vianai Systems",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_665",
        "KW_592"
      ],
      "companyDomains": [
        "vian.ai",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Big News Network",
      "title": "Big Tech loses billions as AI spending worries grow",
      "url": "http://bignewsnetwork.com/news/278873933/big-tech-loses-billions-as-ai-spending-worries-grow",
      "desc": "NEW YORK CITY, New York: The world's biggest technology companies have shed hundreds of billions of dollars in market value this year, as investors grow wary that massive spending on artificial intelligence may not deliver returns strong enough to justify high valuations. Microsoft shares have fallen about 17 percent year-to-date, cutting roughly US$613 billion from its market value and leaving the company worth",
      "hash": "9f9b2f3df22e973f179d61db4fb46ad1",
      "triggerNames": [
        "business outlook & projections",
        "revenue/sales decline"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_688",
        "KW_611"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Times of India",
      "title": "Sam Altman admits AI will impact job market, but adds: “We always find new things to do, and I have no doubt…”",
      "url": "https://timesofindia.indiatimes.com/technology/tech-news/sam-altman-admits-ai-will-impact-job-market-but-adds-we-always-find-new-things-to-do-and-i-have-no-doubt/articleshow/128552885.cms",
      "desc": "Sam Altman admits AI will impact job market, but adds: “We always find new things to do, and I have no doubt…”",
      "hash": "519ec044df58b4ca02157c027d1fca91",
      "triggerNames": [
        "executive statement"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "a4dab5f4f705e1c9e784e0a1e3b51c8d",
          "title": "Sam Altman admits AI will impact job market",
          "desc": "",
          "publisher": "The Times of India",
          "url": "https://timesofindia.indiatimes.com/technology/tech-news/sam-altman-admits-ai-will-impact-job-market-but-adds-we-always-find-new-things-to-do-and-i-have-no-doubt/articleshow/128552885.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Business Korea",
      "title": "Musk Joins Hunt for ‘K-Semiconductor Talent’",
      "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=263446",
      "desc": "The global talent war is heating up as Elon Musk, CEO of Tesla, has directly issued a public recruitment message targeting Korean semiconductor talent. Concerns over brain drain are mounting as big tech companies including Nvidia are aggressively hiring to achieve semiconductor self-sufficiency and",
      "hash": "a328176141eeb141b744d3989faaa567",
      "triggerNames": [
        "hiring",
        "business expansion"
      ],
      "companyNames": [
        "Tesla",
        "Nvidia"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_529"
      ],
      "companyDomains": [
        "tesla.com",
        "nvidia.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The New York Times",
      "title": "Bill Gates Continues to Pare Down His Lakeside Compound Near Seattle",
      "url": "https://www.nytimes.com/2026/02/19/realestate/bill-gates-continues-to-pare-down-his-lakeside-compound-near-seattle.html",
      "desc": "The Microsoft co-founder has listed another house on the property. Also on the market, a penthouse in Taylor Swift’s rumored wedding venue and Hulk Hogan’s oceanfront mansion.",
      "hash": "341e2fee8e8a27355e01777652d1132e",
      "triggerNames": [
        "divestment"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_519"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Bloomberg Technology",
      "title": "Altman Warns About Dangers of Dictators Using AI",
      "url": "https://www.bloomberg.com/news/videos/2026-02-19/altman-warns-about-dangers-of-dictators-using-ai-video",
      "desc": "OpenAI CEO Sam Altman discusses the democratization of AI, saying we should remain “humble” about what we still don’t know about superintelligence. He pointed to the uncertainty around how the technology could be used by totalitarian governments while speaking at India's AI summit.\n\n (Source: Bloomberg)",
      "hash": "d6f57c9b7aae3870e07b1407beb1f59c",
      "triggerNames": [
        "executive statement",
        "events & conferences"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Athletic",
      "title": "Manchester United to provide free coach travel for fans for Bournemouth trip",
      "url": "https://www.nytimes.com/athletic/7057137/2026/02/19/manchester-united-coach-travel-free-bournemouth/",
      "desc": "The game on Friday, April 20 is the latest to have been shifted to a time that is potentially inconvenient for travelling fans.",
      "hash": "c705b2efa48f229d9a1a9e6f9a0a8617",
      "triggerNames": [
        "donation & sponsorship",
        "new initiatives and programs"
      ],
      "companyNames": [
        "Manchester United"
      ],
      "triggerCodes": [
        "KW_592",
        "KW_801"
      ],
      "companyDomains": [
        "manutd.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "37343e7eed0816d036655bdb2cd8e625",
          "title": "Manchester United to provide free coach travel for fans for Bournemouth trip",
          "desc": "The game on Friday, March 20 is the latest to have been shifted to a time that is potentially inconvenient for travelling fans.",
          "publisher": "The Athletic",
          "url": "https://www.nytimes.com/athletic/7057137/2026/02/19/manchester-united-coach-travel-free-bournemouth/",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "The Irish Times",
      "title": "US firms Apple, Microsoft and Eli Lilly paid almost 50% of State’s corporate tax in 2024",
      "url": "https://www.irishtimes.com/business/economy/2026/02/19/three-multinational-companies-paid-close-to-50-of-states-corporate-tax-in-2024/",
      "desc": "Report by Irish Fiscal Advisory Council highlights ‘exceptionally concentrated’ nature of Ireland’s corporate tax base",
      "hash": "d22319f602c2016f1db50486b60034f4",
      "triggerNames": [
        "financial result",
        "research and publications"
      ],
      "companyNames": [
        "Apple",
        "Microsoft",
        "Eli Lilly"
      ],
      "triggerCodes": [
        "KW_589",
        "KW_510"
      ],
      "companyDomains": [
        "apple.com",
        "microsoft.com",
        "lilly.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Latestly",
      "title": "Business News | Vishal Sikka Clarifies 2015 Proposed Investment in OpenAI Amid Missed Opportunity Debate",
      "url": "https://www.latestly.com/agency-news/business-news-vishal-sikka-clarifies-2015-proposed-investment-in-openai-amid-missed-opportunity-debate-7320737.html",
      "desc": "Get latest articles and stories on Business at LatestLY.  Former Infosys CEO and founder & CEO Vianai systems ,Vishal Sikka on Thursday addressed the questions about an early association with OpenAI, clarifying that the engagement was philanthropic in nature.",
      "hash": "69cc0afc66c3e58b12ae9ce158a4bd63",
      "triggerNames": [
        "executive statement",
        "investment"
      ],
      "companyNames": [
        "Vianai Systems",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_708"
      ],
      "companyDomains": [
        "vian.ai",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Big News Network",
      "title": "\"India's leadership in Sovereign AI great to watch,\" says Open AI CEO Sam Altman",
      "url": "http://bignewsnetwork.com/news/278876910/india-leadership-in-sovereign-ai-great-to-watch-says-open-ai-ceo-sam-altman",
      "desc": "New Delhi [India], February 19 (ANI): Sam Altman, the Chief Executive Officer of Open AI, has hailed the India AI Impact Summit 2026 as a critical platform for international cooperation. Delivering the keynote address at the India AI Impact Summit 2026 in New Delhi, Altman said India's rapid adoption of AI technologies and its push toward sovereign AI infrastructure position it uniquely in the global technology l",
      "hash": "80bbef3ea8edb5b94d98b653770b106b",
      "triggerNames": [
        "events & conferences",
        "executive statement"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "c865098cdc83aca6e047cb404464f12d",
          "title": "India’s AI Opportunity Is Amazing: Sam Altman Hails Country as OpenAI’s Fastest Growing Market at India AI Impact Summit 2026",
          "desc": "OpenAI CEO Sam Altman on Thursday said India is witnessing extraordinary growth in Artificial Intelligence adoption, describing the country as one of the company’s fastest-growing markets globally. Speaking to media on the sideline of ‘India AI Impact Summit 2026’ in the national capital, Altman said India's AI opportunity is amazing. It's great to be here.",
          "publisher": "Latestly",
          "url": "https://www.latestly.com/technology/indias-ai-opportunity-is-amazing-sam-altman-hails-country-as-openais-fastest-growing-market-at-india-ai-impact-summit-2026-7320682.html",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "625869289fc459aa1b34c6b7a1529709",
          "title": "AI Summit 2026: Sam Altman hails India as global AI leader, predicts \"new and better\" jobs",
          "desc": "New Delhi [India], February 19 (ANI): Highlighting India's pivotal role in the global technological landscape, OpenAI CEO Sam Altman on Thursday stated that the country is currently leading the world in AI adoption and is poised to become one of the largest markets for the technology. He said that India is not just participating in the Artificial Intelligence revolution but leading it. Speaking to ANI at th",
          "publisher": "Big News Network",
          "url": "http://bignewsnetwork.com/news/278876880/ai-summit-2026-sam-altman-hails-india-as-global-ai-leader-predicts-new-and-better-jobs",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "CNBC",
      "title": "Chinese tech companies progress 'remarkable,' OpenAI's Altman tells CNBC",
      "url": "https://www.cnbc.com/2026/02/19/openai-sam-altman-india-ai-summit.html",
      "desc": "Top tech executives gathered in India this week for the AI summit in New Delhi.",
      "hash": "12d046a3dc591b3940b9256547247d18",
      "triggerNames": [
        "events & conferences",
        "executive statement"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Livemint",
      "title": "OpenAI's Sam Altman: AI will definitely impact job market, but ‘we’ll find better things to do’",
      "url": "https://www.livemint.com/technology/tech-news/openai-sam-altman-ai-will-definitely-impact-job-market-but-we-ll-find-better-things-to-do-ai-impact-summit-20-chtgpt-11771487925550.html",
      "desc": "At the India AI Impact Summit 2026, Sam Altman praised India's leadership in AI innovation and its potential to create new jobs. Amid concerns over job losses due to automation, he reassured that technology will pave the way for more meaningful work in the future.",
      "hash": "f87030854163f930c76482ec4af2f5ca",
      "triggerNames": [
        "events & conferences",
        "executive statement"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Economic Times",
      "title": "Superintelligence soon? OpenAI CEO Sam Altman predicts advanced AI could arrive within a few years",
      "url": "https://economictimes.indiatimes.com/ai/ai-insights/ai-impact-summit-2026-sam-altman-openai-superintelligence-india-2028-forecast-advanced-artificial-intelligence-could-arrive-within-a-few-years/articleshow/128546196.cms",
      "desc": "AI Impact Summit 2026: Sam Altman, leading OpenAI, predicts that early superintelligence could be upon us within the next few years. He envisions a future by 2028 where the intelligence housed in data centers surpasses that of humanity as a whole. Recognising India's vital contribution to the AI landscape, Altman stresses the need for equitable access to technology and robust societal structures.",
      "hash": "ef64ec2b03a9fe8c01f238041b87d4a9",
      "triggerNames": [
        "events & conferences",
        "executive statement"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Economic Times",
      "title": "OpenAI's Altman says world 'urgently' needs AI regulation",
      "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/openais-altman-says-world-urgently-needs-ai-regulation/articleshow/128546812.cms",
      "desc": "Sam Altman, head of ChatGPT maker OpenAI, told a global artificial intelligence conference on Thursday that the world \"urgently\" needs to regulate the fast-evolving technology. \"This is not to suggest that we won't need any regulation or safeguards,\" Altman said.",
      "hash": "640b35cbbb3d9c05ef3ac29dc4ae487a",
      "triggerNames": [
        "executive statement",
        "legislation & regulation"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_585"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "a515e3e47dd36913002f6e9eede845db",
          "title": "OpenAI’s Altman says world ‘urgently’ needs AI regulation",
          "desc": "Many researchers and campaigners believe stronger action is needed to combat emerging issues, ranging from job disruption to sexualised deepfakes and AI-enabled online scams.",
          "publisher": "Free Malaysia Today",
          "url": "https://www.freemalaysiatoday.com/category/business/2026/02/19/openais-altman-says-world-urgently-needs-ai-regulation",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "95651a84926c892fc5e25792c8e52761",
          "title": "AI Impact Summit 2026: OpenAI chief Sam Altman calls for ‘urgent’ global AI regulation",
          "desc": "At the AI Impact Summit in New Delhi, Sam Altman highlighted urgent global regulation of artificial intelligence, proposing an IAEA-style body to manage risks. He warned of biosecurity threats, backed democratised access with safeguards, and highlighted India’s 100 million weekly ChatGPT users.",
          "publisher": "Livemint",
          "url": "https://www.livemint.com/technology/tech-news/ai-impact-summit-2026-openai-chief-sam-altman-calls-for-urgent-global-ai-regulation-11771493496276.html",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "The Hindu Business Line",
      "title": "India AI Impact Summit 2026 Live: On the current trajectory, super intelligence may only be a couple of years away: Sam Altman",
      "url": "https://www.thehindubusinessline.com/info-tech/india-ai-impact-summit-2026-pm-modi-new-delhi-live-updates/article70646444.ece",
      "desc": "This day brings together India Inc.’s biggest names and the world’s top AI leaders for what promises to be a packed event with big announcements",
      "hash": "43c0151b2ebd7cee6e063dc40d57e03b",
      "triggerNames": [
        "events & conferences",
        "executive statement"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "467ac85d1f986c3c9ece38469b4f59e5",
          "title": "India AI Impact Summit 2026 Live: Super intelligence may only be a couple of years away, OpenAI's Sam Altman says",
          "desc": "This day brings together India Inc.’s biggest names and the world’s top AI leaders for what promises to be a packed event with big announcements",
          "publisher": "The Hindu Business Line",
          "url": "https://www.thehindubusinessline.com/info-tech/india-ai-impact-summit-2026-pm-modi-new-delhi-live-updates/article70646444.ece",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "af117bd6ac04890c64578cc3ed0fadab",
          "title": "India AI Impact Summit 2026 Highlights Feb 19: Superintelligence may only be a couple of years away, OpenAI's Sam Altman says",
          "desc": "February 19 saw India Inc.’s biggest names and the world’s top AI leaders come together for a packed event with big announcements",
          "publisher": "The Hindu Business Line",
          "url": "https://www.thehindubusinessline.com/info-tech/india-ai-impact-summit-2026-pm-modi-new-delhi-live-updates/article70646444.ece",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Latestly",
      "title": "Business News | AI Will Play Key Role in Shaping Economic Balance Between Global North and South: Microsoft's Brad Smith",
      "url": "https://www.latestly.com/agency-news/business-news-ai-will-play-key-role-in-shaping-economic-balance-between-global-north-and-south-microsofts-brad-smith-7320635.html",
      "desc": "Get latest articles and stories on Business at LatestLY.  Microsoft Vice Chair and President Brad Smith on Thursday said artificial intelligence (AI) will play a decisive role in shaping the global economic balance, particularly between the Global North and South.",
      "hash": "65fe5f40bd87945f649660b8f22362f6",
      "triggerNames": [
        "executive statement"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_583"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "6e5b07d088110340255cbf04acb07c7d",
          "title": "AI will play key role in shaping economic balance between Global North and South: Microsoft's Brad Smith",
          "desc": "New Delhi [India], February 19 (ANI): Microsoft Vice Chair and President Brad Smith on Thursday said artificial intelligence (AI) will play a decisive role in shaping the global economic balance, particularly between the Global North and South. Speaking at the India AI Impact Summit 2026, Smith said, 'I think the best way to think about AI is to look at it more broadly and think about the state of the world we li",
          "publisher": "Big News Network",
          "url": "http://bignewsnetwork.com/news/278876912/ai-will-play-key-role-in-shaping-economic-balance-between-global-north-and-south-microsoft-brad-smith",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Latestly",
      "title": "Business News | MAHE Partners with OpenAI to Integrate Artificial Intelligence Across Teaching, Learning, and Research",
      "url": "https://www.latestly.com/agency-news/business-news-mahe-partners-with-openai-to-integrate-artificial-intelligence-across-teaching-learning-and-research-7320655.html",
      "desc": "Get latest articles and stories on Business at LatestLY.  Manipal (Karnataka) [India], February 19: Manipal Academy of Higher Education (MAHE), an Institution of Eminence Deemed to be University, has partnered with OpenAI to integrate advanced artificial intelligence (AI) tools across teaching, research, and academic administration. This collaboration aims to enhance learning outcomes, accelerate research productivity, and equip students and faculty with critical AI skills for a rapidly evolving global workforce. MAHE will implement AI-powered tools and resources across its academic programs to support personalised learning, boost critical thinking, and encourage ethical AI use. Faculty will also gain access to advanced AI tools for curriculum planning, research, and innovation.",
      "hash": "27e6d452d2ca962995e9d5d575457ddc",
      "triggerNames": [
        "alliance & partnership"
      ],
      "companyNames": [
        "Manipal Academy of Higher Education (MAHE)",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_512"
      ],
      "companyDomains": [
        "manipal.edu",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "NDTV",
      "title": "AI Impact Summit 2026 Day 4 Live: More Than 100 Million Indians Use ChatGPT Every Week, Says Sam Altman; PM Modi Launches MANAV,",
      "url": "https://www.ndtvprofit.com/technology/ai-impact-summit-2026-day-4-live-updates-pm-modi-to-inaugurate-indian-ai-impact-summit-day-in-new-delhi-events-speakers-11056457#publisher=newsstand",
      "desc": "Prime Minister Narendra Modi opened the day by welcoming delegates from more than 100 countries",
      "hash": "60ad1412bf8201c560e3123e7034236f",
      "triggerNames": [
        "events & conferences",
        "new initiatives and programs"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_649",
        "KW_801"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Economic Times",
      "title": "JioHotstar brings ChatGPT voice assistant to help you decide what to watch",
      "url": "https://economictimes.indiatimes.com/industry/media/entertainment/media/jiohotstar-openai-chatgpt-voice-assistant-natural-language-led-streaming-search/articleshow/128543079.cms",
      "desc": "JioHotstar is introducing a new voice assistant powered by ChatGPT. Viewers can now discover movies, shows, and live sports by speaking their preferences. This feature allows for natural language queries across multiple languages. It aims to make content discovery more interactive and personalized. The integration will also provide JioHotstar recommendations when using ChatGPT.",
      "hash": "a56ac357630c546b29f813a480197c7f",
      "triggerNames": [
        "new service launch",
        "alliance & partnership"
      ],
      "companyNames": [
        "JioHotstar",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_512",
        "KW_566"
      ],
      "companyDomains": [
        "hotstar.com",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "88f6d12720ea2ae1029185c5afd8efd6",
          "title": "What Should I Watch? JioHotstar’s New ChatGPT Feature Has The Answer",
          "desc": "JioHotstar on Thursday announced a partnership with OpenAI to bring a ChatGPT-powered voice and text assistant to its streaming platform. The new feature will let viewers find shows and movies simply by speaking or typing what they feel like watching. Instead of scrolling endlessly or searching with keywords, users can describe their mood or situation and get personalised suggestions. The assistant will work in multiple Indian languages and understand natural, everyday conversation. The companies said the goal is to solve the common “what should I watch” problem by making discovery more intuitive. The feature will roll out in phases, starting with select live and on-demand content, and expand gradually. Uday Shankar, Vice Chairman of JioStar, said AI represents “a transformative shift for the media and entertainment industry,” adding that it disrupts the value chain “from conceptualisation and production to discovery and monetisation.” “As a tech-native, user-first platform, JioStar is embedding AI at the very core of the user experience,” Shankar said. The OpenAI partnership, he added, will allow viewers to discover and curate content “simply using their voice,” calling it “a fundamental reimagining of the entertainment experience.” Fidji Simo, CEO of Applications at OpenAI, said AI changes entertainment from a passive experience to a more interactive one. “Through our partnership with JioHotstar, we’re bringing personalized AI directly into entertainment and live sports,” she said, adding that users will be able to move “from watching to asking” in ways that feel natural and useful. The assistant will also work during live sports. Viewers can ask about key moments, scores or player highlights and get quick answers in a simple, conversational way. The partnership goes beyond the JioHotstar app. Users who ask ChatGPT for movie or show suggestions will also receive relevant recommendations and direct streaming links from JioHotstar’s catalogue. This creates a two-way connection between the two platforms. The launch comes at a time when streaming services in India are competing to offer more personalised experiences. AI-powered recommendations are increasingly becoming a key way for platforms to stand out and keep viewers engaged.",
          "publisher": "CIOL",
          "url": "https://www.ciol.com/news/jiohotstar-openai-chatgpt-voice-assistant-india-launch-11133310",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Economic Times",
      "title": "When AI can’t fix egos: OpenAI’s Sam Altman and Anthropic’s Dario Amodei skip hand-hold at Delhi AI Summit",
      "url": "https://economictimes.indiatimes.com/news/new-updates/when-ai-cant-fix-egos-openais-sam-altman-and-anthropics-dario-amodei-skip-hand-hold-at-delhi-ai-summit/articleshow/128544689.cms",
      "desc": "At the AI Impact Summit, Prime Minister Modi advocated for shared AI development. A subtle moment saw OpenAI's Sam Altman and Anthropic's Dario Amodei, rivals in the AI race, standing apart during a group gesture, sparking buzz amidst their companies' escalating competition and funding surges.",
      "hash": "fce75796f2dcea57c582fcd2d89b88a5",
      "triggerNames": [
        "events & conferences",
        "executive statement"
      ],
      "companyNames": [
        "OpenAI",
        "Anthropic"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "openai.com",
        "anthropic.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "a601849f202e5e0a6d4a66556d593e95",
          "title": "OpenAI CEO Sam Altman on awkward moment with Anthropic CEO Dario Amodei at India AI Summit going viral; says: I was sort of …",
          "desc": "OpenAI CEO Sam Altman addressed an awkward onstage moment at the India AI Impact Summit 2026, where he and Anthropic CEO Dario Amodei appeared to hesitate during a group photo with Prime Minister Narendra Modi. Altman stated he was confused about the expected pose, mistaking it for an 'open clock' gesture.",
          "publisher": "The Times of India",
          "url": "https://timesofindia.indiatimes.com/technology/tech-news/openai-ceo-sam-altman-on-awkward-moment-with-anthropic-ceo-dario-amodei-at-india-ai-summit-going-viral-says-i-was-sort-of-/articleshow/128556462.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "517d495cf826f5e99fe461946a6fecff",
          "title": "Modi’s AI unity pose turns awkward for Altman and Amodei",
          "desc": "NEW DELHI: When Indian Prime Minister Narendra Modi nudged speakers at the India AI summit to join and raise their hands in a symbolic show of unity, most executives obliged. Two did not: rivals Sam Altman of OpenAI and Dario Amodei of Anthropic. The two, who are locked in one of Silicon Valley’s fiercest commercial rivalries, were standing side by side as the 13 corporate leaders joined Modi on stage, but they kept their raised fists conspicuously apart. Altman appeared visibly uncomfortable, looking away as the others, including Alphabet’s Sundar Pichai, went along with Modi’s nudge and joined hands. READ MORE: Reliance, Adani drive India’s AI push with plans to invest $210 billion The episode, captured on camera and widely shared across social media, drew amused and pointed reactions online, with many users describing it as emblematic of the “AI cold war” between OpenAI and Anthropic. “I didn’t know what was happening on stage. I wasn’t sure what we were supposed to be doing,” Altman later told news website Moneycontrol. OpenAI and Anthropic did not respond to Reuters requests for comment. Bill Gates pulled out of India’s summit hours before his scheduled keynote address on Thursday, dealing a blow to a flagship event already marred by organisational lapses, a robot row and complaints of traffic chaos. However, the summit has attracted more than $200 billion in investment pledges. READ MORE: Google announce India deals at AI summit Anthropic was co-founded in 2021 by Dario Amodei and other former OpenAI employees who broke away over disagreements about safety, commercialisation, and Altman’s leadership style. The rift has since hardened into a full-blown commercial war. At this year’s Super Bowl, Anthropic aired satirical commercials taking a pointed jab at OpenAI’s plans to introduce advertising inside ChatGPT.",
          "publisher": "Business Recorder",
          "url": "https://www.brecorder.com/news/40408063/modis-ai-unity-pose-turns-awkward-for-altman-and-amodei",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "2e9872793d0844dff98dbea27d7bbd6f",
          "title": "Altman and Amodei share a moment of awkwardness at India’s big AI summit",
          "desc": "When Prime Minister Narendra Modi prompted speakers at the event to join hands and raise them in a show of unity, all executives on stage obliged, except OpenAI's Sam Altman and Anthropic's Dario Amodei, who held their hands conspicuously apart.",
          "publisher": "Techcrunch",
          "url": "https://techcrunch.com/2026/02/19/altman-and-amodei-share-a-moment-of-awkwardness-at-indias-big-ai-summit/",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Bloomberg Technology",
      "title": "OpenAI’s Altman Sees 'Early Versions' of Artificial General Intelligence Within Two Years",
      "url": "https://www.bloomberg.com/news/live-blog/2026-02-19/india-ai-impact-summit-2026",
      "desc": "Visitors use mobile phones as they walk past a hoarding of a virtual reality headset displayed at the AI Impact Summit in New Delhi on Feb. 17. Photographer: ARUN SANKAR/AFP",
      "hash": "2c788adfda17802ac22e2b9d2fd2ba92",
      "triggerNames": [
        "executive statement",
        "business outlook & projections"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_688"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Economic Times",
      "title": "JioHotstar partners OpenAI to launch ChatGPT-powered conversational streaming in India",
      "url": "https://economictimes.indiatimes.com/industry/media/entertainment/jiohotstar-partners-openai-to-launch-chatgpt-powered-conversational-streaming-in-india/articleshow/128544605.cms",
      "desc": "JioHotstar-OpenAI deal: For more than a decade, digital entertainment has largely been a one-way experience: browse, click, watch. With this rollout, JioHotstar is positioning streaming as a two-way interaction that interprets nuance, layered prompts and cultural context in real time.",
      "hash": "eb955c70521353b44095b194fe77598a",
      "triggerNames": [
        "alliance & partnership",
        "new service launch"
      ],
      "companyNames": [
        "JioHotstar",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_512",
        "KW_566"
      ],
      "companyDomains": [
        "hotstar.com",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "c69d424d29850de2372b7563a8ae5919",
          "title": "JioHotstar teams up with OpenAI to bring ChatGPT-driven content discovery in India",
          "desc": "Reliance Industries-led JioHotstar announced a partnership with OpenAI on Thursday.",
          "publisher": "Livemint",
          "url": "https://www.livemint.com/companies/news/jiohotstar-teams-up-with-openai-to-bring-chatgpt-driven-content-discovery-in-india-11771487034949.html",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "dd6ab775c0b07c35efd804a44007111b",
          "title": "JioHotstar teams up with OpenAI to bring ChatGPT-driven content discovery in India",
          "desc": "Reliance-owned JioHotstar has partnered with OpenAI to introduce ChatGPT-powered voice discovery on its platform. The new multilingual feature will let users find content through natural speech, offering personalised, context-aware recommendations across live and on-demand streaming.",
          "publisher": "Livemint",
          "url": "https://www.livemint.com/companies/news/jiohotstar-teams-up-with-openai-to-bring-chatgpt-driven-content-discovery-in-india-11771487034949.html",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "16aadd5d850940896acc4b0976c29268",
          "title": "JioHotstar and OpenAI Announce Partnership To Integrate ChatGPT-Powered Voice Assistant for Conversational Streaming",
          "desc": "JioHotstar has partnered with OpenAI to launch a ChatGPT-powered voice assistant, making content discovery more conversational. The AI tool understands regional languages and provides context-aware recommendations for movies and live sports. This phased integration aims to eliminate passive scrolling, allowing users to engage deeply with the platform’s extensive media catalogue.",
          "publisher": "Latestly",
          "url": "https://www.latestly.com/technology/jiohotstar-and-openai-announce-partnership-to-integrate-chatgpt-powered-voice-assistant-for-conversational-streaming-7320661.html",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "e279a8319a96073e06cd9f88fc70e862",
          "title": "Entertainment News | JioHotstar, OpenAI Launch ChatGPT-powered Conversational Streaming in India",
          "desc": "Get latest articles and stories on Entertainment at LatestLY.  Using OpenAI APIs, the voice and text interface will allow users to explore India's largest streaming library through natural language conversations in multiple languages.",
          "publisher": "Latestly",
          "url": "https://www.latestly.com/agency-news/entertainment-news-jiohotstar-openai-launch-chatgpt-powered-conversational-streaming-in-india-7320975.html",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "f4b7dc2e386097b90ae6a4853858a7ef",
          "title": "JioHotstar Partners With OpenAI To Introduce ChatGPT-Powered Voice Search On Its OTT Platform",
          "desc": "",
          "publisher": "Free Press Journal",
          "url": "https://www.freepressjournal.in/tech/ai-summit-delhi-2026-jiohotstar-openai-chatgpt-ott-service",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "0c59ffe0106bf166c3c94029c71693f8",
          "title": "ChatGPT Nows Recommends And Shares Streaming Links To JioHotstar",
          "desc": "JioHotstar and OpenAI have also collaborated to introduce a ChatGPT-powered voice discovery feature.",
          "publisher": "NDTV",
          "url": "https://www.ndtvprofit.com/technology/chatgpt-nows-recommends-and-shares-streaming-links-to-jiohotstar-11072000#publisher=newsstand",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "b7739f729dd74e0bbba0c5d2b56caf03",
          "title": "JioHotstar, OpenAI launch ChatGPT-powered conversational streaming in India",
          "desc": "Mumbai (Maharashtra) [India], February 19 (ANI): JioHotstar and OpenAI have announced a landmark partnership turning that into a human-language conversation by introducing a ChatGPT-powered voice discovery and immersive experience into the heart of India's largest streaming destination. Through this collaboration, JioHotstar is solving the 'what to watch' dilemma through Multilingual Cognitive Search, replacing",
          "publisher": "Big News Network",
          "url": "http://bignewsnetwork.com/news/278877173/jiohotstar-openai-launch-chatgpt-powered-conversational-streaming-in-india",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "YourStory",
      "title": "Pine Labs partners with OpenAI to embed AI into its merchant stack",
      "url": "https://yourstory.com/2026/02/pine-labs-partners-with-openai-to-embed-ai-in-its-merchant-stack",
      "desc": "The partnership aims to drive 'agentic commerce' by embedding AI-driven reasoning into high-volume financial workflows.",
      "hash": "9261debf81c886c1e96fb22fef5ea051",
      "triggerNames": [
        "alliance & partnership",
        "new initiatives and programs"
      ],
      "companyNames": [
        "Pine Labs",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_512",
        "KW_801"
      ],
      "companyDomains": [
        "pinelabs.com",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "11933658bd732251a9641337e1910835",
          "title": "Pine Labs partners OpenAI for agentic commerce",
          "desc": "Pine Labs partners OpenAI for agentic commerce",
          "publisher": "The Times of India",
          "url": "https://timesofindia.indiatimes.com/business/india-business/pine-labs-partners-openai-for-agentic-commerce/articleshow/128551503.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "eb028b27f6ee6a658fbfdc1fc6ec6371",
          "title": "Pine Labs partners OpenAI for agentic commerce",
          "desc": "",
          "publisher": "The Times of India",
          "url": "https://timesofindia.indiatimes.com/business/india-business/pine-labs-partners-openai-for-agentic-commerce/articleshow/128551503.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "The Irish Times",
      "title": "Uber in Ireland, the multinationals propping up the economy and the ChatGPT caricature trend",
      "url": "https://www.irishtimes.com/podcasts/early-edition/uber-in-ireland-the-multinationals-propping-up-the-economy-and-the-chatgpt-caricature-trend/",
      "desc": "Early Edition with Aideen Finnegan: Also, the Dublin engineer re-inventing the dog lead",
      "hash": "7c7f90e762f5da9ebd4bffbcc9fc4228",
      "triggerNames": [
        "business expansion",
        "new product launch"
      ],
      "companyNames": [
        "Uber",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_521"
      ],
      "companyDomains": [
        "uber.com",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Economic Times",
      "title": "TCS shares rise 2% after Tata Group and OpenAI announce strategic partnership",
      "url": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-shares-rise-2-after-tata-group-and-openai-announce-strategic-partnership/articleshow/128542438.cms",
      "desc": "Tata Consultancy Services (TCS) shares surged after announcing a strategic partnership with OpenAI to build AI infrastructure in India and offer joint market solutions. This collaboration aims to boost productivity, enhance software engineering, and position India as a global AI hub by developing AI-ready, green-energy-powered data centers.",
      "hash": "1ccda4d35324fb06bfe89e151f974256",
      "triggerNames": [
        "alliance & partnership"
      ],
      "companyNames": [
        "Tata Consultancy Services (TCS)",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_512"
      ],
      "companyDomains": [
        "tcs.com",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "2a088322a1ca59f4a26bc4bef4c73030",
          "title": "TCS Shares Jump 2% As Tata Group Strikes Major OpenAI Partnership For AI Infrastructure In India",
          "desc": "",
          "publisher": "Free Press Journal",
          "url": "https://www.freepressjournal.in/business/tcs-shares-jump-2-as-tata-group-strikes-major-openai-partnership-for-ai-infrastructure-in-india",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "7a9f8c114979febab147ed8d6b5712e8",
          "title": "AI boost! Tata Group announces partnership with OpenAI; TCS stock rises around 2%",
          "desc": "Tata Consultancy Services has partnered with OpenAI to build AI infrastructure in India, aiming to enhance productivity and innovation. The collaboration will leverage OpenAI's enterprise ChatGPT and Codex tools, with TCS developing AI-ready, green energy-powered data centers. This strategic alliance seeks to position India as a global AI hub and empower its youth for the AI era.",
          "publisher": "The Times of India",
          "url": "https://timesofindia.indiatimes.com/business/india-business/ai-boost-tata-group-announces-partnership-with-openai-tcs-stock-rises-around-2/articleshow/128543642.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "7963f919007ca327840e44aa02264a69",
          "title": "TCS-OpenAI Strategic Alliance: Tata Group IT major to build 100MW AI facility",
          "desc": "Tata Consultancy Services has partnered with OpenAI to build AI infrastructure in India, aiming to enhance productivity and innovation. The collaboration will leverage OpenAI's enterprise ChatGPT and Codex tools, with TCS developing AI-ready, green energy-powered data centers. This strategic alliance seeks to position India as a global AI hub and empower its youth for the AI era.",
          "publisher": "The Times of India",
          "url": "https://timesofindia.indiatimes.com/business/india-business/ai-boost-tata-group-announces-partnership-with-openai-tcs-stock-rises-around-2/articleshow/128543642.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Zee BIZ",
      "title": "OpenAI, TCS and Tata Group partner to build AI infrastructure in India—Why this matters for TCS and India",
      "url": "https://www.zeebiz.com/companies/news-openai-tcs-and-tata-group-partner-to-build-ai-infrastructure-in-india-why-this-matters-for-tcs-and-india-390746",
      "desc": "As part of the agreement, TCS’ HyperVault unit will build AI infrastructure in India with an initial capacity of 100 megawatt (MW). This capacity can be expanded to 1 gigawatt (GW) over time. The infrastructure will support large AI computing needs of companies and help both Indian and global firms use AI tools more efficiently.",
      "hash": "bc822a8c70b2ebc0c10c5128119ee8ee",
      "triggerNames": [
        "alliance & partnership",
        "business expansion"
      ],
      "companyNames": [
        "OpenAI",
        "Tata Consultancy Services (TCS)",
        "Tata Group"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_512"
      ],
      "companyDomains": [
        "openai.com",
        "tcs.com",
        "tata.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Hindu Business Line",
      "title": "MAHE collaborates with OpenAI to integrate AI across teaching, learning, and research",
      "url": "https://www.thehindubusinessline.com/news/education/mahe-collaborates-with-openai-to-integrate-ai-across-teaching-learning-and-research/article70650497.ece",
      "desc": "Collaboration aims to enhance learning outcomes, accelerate research productivity, and equip students and faculty with critical AI skills for a rapidly evolving global workforce",
      "hash": "709703f393151984094e808ab832b8ea",
      "triggerNames": [
        "alliance & partnership"
      ],
      "companyNames": [
        "Manipal Academy of Higher Education (MAHE)",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_512"
      ],
      "companyDomains": [
        "manipal.edu",
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "The Business Journals",
      "title": "The Beat: Federal court halts OpenAI use of Chicago brand name",
      "url": "https://www.bizjournals.com/chicago/news/2026/02/18/the-beat-chicago-openai-injunction.html?ana=brss_1049",
      "desc": "Also from The Beat this week: How Chicago-area schools stack up at producing unicorn startup founders.",
      "hash": "bef17110f0839cd9c6f4893ae578d22b",
      "triggerNames": [
        "law suit/judgement/ settlement",
        "regulatory ban & enforcement"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_526",
        "KW_613"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Economic Times",
      "title": "AI Summit 2026: Tata's N Chandrasekaran makes bold AI bets while Dalal Street anxiety grips TCS",
      "url": "https://economictimes.indiatimes.com/ai/ai-insights/ai-summit-2026-tatas-n-chandrasekaran-makes-bold-ai-bets-while-dalal-street-anxiety-grips-tcs/articleshow/128538520.cms",
      "desc": "Tata AI news: Tata Group's Executive Chairperson Natarajan Chandrasekaran identified AI as the next significant opportunity for India's IT sector. He announced a partnership with OpenAI to build India's first large-scale, AI-optimized data center, starting with 100 megawatts and scaling to one gigawatt, to support AI training and inference.",
      "hash": "2b7cff1ddd16a9952c14a679496893bd",
      "triggerNames": [
        "alliance & partnership",
        "business expansion"
      ],
      "companyNames": [
        "Tata Group",
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_512"
      ],
      "companyDomains": [
        "tata.com",
        "openai.com"
      ],
      "publishDate": "2026-02-18",
      "similarNews": [
        {
          "hash": "4995f61f38d50c64a326cfb13d60358a",
          "title": "AI biggest opportunity for IT sector: Tata Sons chairman Chandrasekaran",
          "desc": "Tata Sons chairman N. Chandrasekaran declared AI the technology sector's biggest opportunity, emphasizing IT's role in integrating AI for enterprise transformation.  The Tata Group is investing in AI infrastructure, partnering with OpenAI and AMD, and developing an AI data insights platform.  They are also creating industry-specific AI solutions and venturing into AI-optimized semiconductor design, starting with the automotive sector.",
          "publisher": "The Times of India",
          "url": "https://timesofindia.indiatimes.com/technology/tech-news/ai-biggest-opportunity-for-it-sector-tata-sons-chairman-chandrasekaran/articleshow/128542527.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "CNBC",
      "title": "Watch CNBC's full interview with Microsoft President Brad Smith at the AI Impact Summit in India",
      "url": "https://www.cnbc.com/video/2026/02/19/watch-cnbcs-full-interview-with-microsoft-president-brad-smith-at-the-ai-impact-summit-in-india.html",
      "desc": "Microsoft President Brad Smith told CNBC’s Arjun Kharpal that U.S. tech companies should “worry a little bit” about the subsidies their Chinese competitors receive from their government in the AI race. They were speaking at the sidelines of the AI Impact Summit in New Delhi, India.",
      "hash": "bea04a69d009b11f8d91229d8daae075",
      "triggerNames": [
        "executive statement",
        "events & conferences"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Bloomberg Technology",
      "title": "OpenAI to Partner With Tata for AI Data Center Buildout in India",
      "url": "https://www.bloomberg.com/news/articles/2026-02-19/openai-to-partner-with-tata-for-ai-data-center-buildout-in-india",
      "desc": "OpenAI is partnering with the Tata Group in India on artificial intelligence technologies, including data center infrastructure that could become one of the largest in the country.",
      "hash": "f83e3e0c578c702f8137f3041ee09519",
      "triggerNames": [
        "alliance & partnership",
        "business expansion"
      ],
      "companyNames": [
        "OpenAI",
        "Tata Group"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_512"
      ],
      "companyDomains": [
        "openai.com",
        "tata.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "1bc243d060837a1668670099959f8433",
          "title": "OpenAI to build India data centre infrastructure with IT giant TCS",
          "desc": "The companies said this infrastructure will power next-generation AI workloads and position India as a global AI hub.",
          "publisher": "Free Malaysia Today",
          "url": "https://www.freemalaysiatoday.com/category/business/2026/02/19/openai-to-build-india-data-centre-infrastructure-with-it-giant-tcs",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "2a922fd80736fdd587096e0b2989f2e5",
          "title": "TCS, Tata Group Partner With OpenAI To Develop AI Infrastructure In India",
          "desc": "",
          "publisher": "Free Press Journal",
          "url": "https://www.freepressjournal.in/tech/tcs-tata-group-partner-with-openai-to-develop-ai-infrastructure-in-india",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "75bd4c13628f0e504d97481df7611106",
          "title": "OpenAI to build India data centre infrastructure with IT giant TCS",
          "desc": "The companies said this will power next-generation AI workloads and position India as a global AI hub.",
          "publisher": "Free Malaysia Today",
          "url": "https://www.freemalaysiatoday.com/category/business/2026/02/19/openai-to-build-india-data-centre-infrastructure-with-it-giant-tcs",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "a5bb9def3f03b3a749a5fc9335fed76f",
          "title": "OpenAI taps Tata for 100MW AI data center capacity in India, eyes 1GW",
          "desc": "OpenAI also plans to expand its presence in India with new offices in Mumbai and Bengaluru later this year.",
          "publisher": "Techcrunch",
          "url": "https://techcrunch.com/2026/02/18/openai-taps-tata-for-100mw-ai-data-center-capacity-in-india-eyes-1gw/",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "409db476e91dc97a9a2fee221656a585",
          "title": "OpenAI partners with India’s Tata for local data centre buildout By Investing.com",
          "desc": "OpenAI partners with India’s Tata for local data centre buildout",
          "publisher": "Investing.com",
          "url": "https://www.investing.com/news/stock-market-news/openai-partners-with-indias-tata-for-local-data-centre-buildout-4512553",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "fe691b1f3c8bec76254bf3ba0ac5465c",
          "title": "OpenAI partners with TCS to build 100MW AI infrastructure in India",
          "desc": "OpenAI and Tata Group have announced a significant partnership at the India AI Impact Summit. OpenAI will utilize Tata's data center infrastructure, starting with 100MW capacity, to power next-generation AI workloads and bolster India's position as a global AI hub. This collaboration aims to transform industries, skill India's youth, and accelerate enterprise AI adoption across the country.",
          "publisher": "The Times of India",
          "url": "https://timesofindia.indiatimes.com/technology/tech-news/openai-partners-with-tcs-to-build-100mw-ai-infrastructure-in-india/articleshow/128542127.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "5ac7296f01f9efd83d855ae989b8fe18",
          "title": "OpenAI and Tata reveal massive AI infrastructure partnership in India, including AI Data Centres",
          "desc": "OpenAI is ramping up its investments in India. After Reliance, the AI… Content originally published on The Tech Portal - Global technology news, latest gadget news and breaking tech news.",
          "publisher": "The Tech Portal",
          "url": "https://thetechportal.com/2026/02/19/openai-and-tata-reveal-massive-ai-infrastructure-partnership-in-india-including-ai-data-centres/",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "f5437bc7fdbf58ff8e2fe37c1a9e8cba",
          "title": "OpenAI partners with TCS on AI deployment, plans new offices in Mumbai and Bengaluru",
          "desc": "India AI Impact Summit 2026: With one of the world’s largest AI enterprise rollouts and a massive new data centre commitment, OpenAI’s deepened alliance with Tata Consultancy Services signals India’s rise as a global powerhouse in artificial intelligence infrastructure, talent, and deployment.",
          "publisher": "Business Today",
          "url": "https://www.businesstoday.in/technology/news/story/openai-partner-with-tcs-on-ai-deployment-plans-new-offices-in-mumbai-and-bangaluru-516903-2026-02-19?utm_source=rssfeed",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "ed99294229960aebaff436f4f88192ef",
          "title": "OpenAI partners with Tata to build AI data center capacity in India",
          "desc": "",
          "publisher": "Seeking Alpha",
          "url": "https://seekingalpha.com/news/4553775-openai-partners-with-tata-to-build-ai-data-center-capacity-in-india?utm_source=feed_news_all&utm_medium=referral&feed_item_type=news",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Bloomberg Technology",
      "title": "Bill Gates Pulls Out of India AI Summit Amid Epstein Criticism",
      "url": "https://www.bloomberg.com/news/articles/2026-02-19/bill-gates-pulls-out-of-address-at-high-profile-india-ai-summit",
      "desc": "Microsoft Corp. co-founder Bill Gates backed out of a keynote address at a high-profile Indian AI summit just hours before he was due to speak.",
      "hash": "28efae2d957b59bdd328b21cb4188d0b",
      "triggerNames": [
        "events & conferences",
        "executive statement"
      ],
      "companyNames": [
        "Microsoft Corp."
      ],
      "triggerCodes": [
        "KW_583",
        "KW_649"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "d0f60af1aade8ab0ecbf98e5028fc519",
          "title": "Bill Gates a last-minute no-show at India AI summit",
          "desc": "Microsoft founder Bill Gates has bailed on the India AI Impact Summit just hours before he was due to give an address at an event already marred by chaos.",
          "publisher": "The West Australian",
          "url": "https://thewest.com.au/technology/telecommunications/bill-gates-a-last-minute-no-show-at-india-ai-summit-c-21691279",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "3f76455cab3830c981f53c473359432e",
          "title": "Bill Gates pulls out of India’s AI summit at the last minute in the latest blow to an event dogged by organizational chaos",
          "desc": "The Microsoft founder's abrupt withdrawal, amid renewed scrutiny over his ties to Jeffrey Epstein, capped a chaotic few days for an event already dogged by cancellations, a robot scandal, and traffic gridlock.",
          "publisher": "Fortune",
          "url": "https://fortune.com/2026/02/19/bill-gates-india-ai-summit-epstein-chaos/",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "6ac260b8e032990cdb2c3e8cfe75b675",
          "title": "Bill Gates pulls out of India’s AI summit amid Epstein controversy",
          "desc": "Microsoft co-founder cancels plans to deliver keynote speech at high-profile event on Thursday",
          "publisher": "Financial Times",
          "url": "https://www.ft.com/content/a6386aa0-8761-489a-99d2-ad5623265389",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Jalopnik",
      "title": "AI Data Center Demand May Cause A New Chip Shortage That Will Affect Auto Manufacturing, Again",
      "url": "https://www.jalopnik.com/2103714/ai-data-center-demand-chip-shortage-auto-manufacturing/",
      "desc": "I'd better get that Xbox memory upgrade before it's too late.",
      "hash": "dff3dadd3c0f17849e56f18132a974b0",
      "triggerNames": [
        "supply chain disruption"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_737"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Economic Times",
      "title": "Microsoft says it does not think US ICE uses firm's tech for mass surveillance of civilians",
      "url": "https://economictimes.indiatimes.com/tech/technology/microsoft-says-it-does-not-think-us-ice-uses-firms-tech-for-mass-surveillance-of-civilians/articleshow/128538596.cms",
      "desc": "The statement from the technology company came ⁠in ⁠response to a report by The Guardian that said ICE deepened its reliance on Microsoft's cloud technology last year as the agency ramped up arrest and deportation operations. The newspaper cited leaked documents.",
      "hash": "c1b4cfea2e57aa4998fdcef74443bcfa",
      "triggerNames": [
        "executive statement"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_583"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-18",
      "similarNews": [
        {
          "hash": "c65ff3d8f92084e6b085cb843b27933b",
          "title": "Microsoft says it does not think US ICE uses firm's tech for mass surveillance of civilians",
          "desc": "The statement from the ‌technology company came ⁠in ⁠response to a report by The Guardian that said ICE deepened its reliance on Microsoft's cloud technology last year as the ​agency ramped up arrest and deportation operations. The newspaper cited leaked documents.",
          "publisher": "The Economic Times",
          "url": "https://economictimes.indiatimes.com/tech/technology/microsoft-says-it-does-not-think-us-ice-uses-firms-tech-for-mass-surveillance-of-civilians/articleshow/128538596.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "ebdfded62e03ba5696ab320f63de5aa8",
          "title": "Microsoft says it does not think US ICE uses firm’s tech for mass surveillance of civilians By Reuters",
          "desc": "Microsoft says it does not think US ICE uses firm’s tech for mass surveillance of civilians",
          "publisher": "Investing.com",
          "url": "https://www.investing.com/news/stock-market-news/microsoft-says-it-does-not-think-us-ice-uses-firms-tech-for-mass-surveillance-of-civilians-4512550",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "a3b22a272fa19de709bc0b9896cb76d1",
          "title": "Microsoft says it doesn’t think ICE is using its tech for mass surveillance",
          "desc": "",
          "publisher": "Seeking Alpha",
          "url": "https://seekingalpha.com/news/4553781-microsoft-says-it-doesnt-think-ice-is-using-its-tech-for-mass-surveillance?utm_source=feed_news_all&utm_medium=referral&feed_item_type=news",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "d42b5039ce4e9f5d035d5a6758645f74",
          "title": "Microsoft: ICE Not Using Our Tech to Surveil US Civilians",
          "desc": "Microsoft said it did not think the U.S. Immigration and Customs Enforcement agency was using its technology for mass surveillance of civilians but added that it provided cloud-based productivity and collaboration tools to ICE.",
          "publisher": "Newsmax",
          "url": "https://www.newsmax.com/finance/companies/microsoft-ice-citizen/2026/02/19/id/1246661",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Business Korea",
      "title": "Hyundai, Tesla Clash Over Robotics Shift",
      "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=263414",
      "desc": "Tesla and Hyundai Motor Group, once rivals in the electric vehicle arena, are now clashing in the field of ‘robots.’ While both share the goal of transforming manufacturing sites with humanoid robots and ultimately creating new revenue streams, their approaches are diverging sharply—drawing signific",
      "hash": "367cd8fad7660c8d13262e75bc31167f",
      "triggerNames": [
        "business expansion",
        "new initiatives and programs"
      ],
      "companyNames": [
        "Hyundai Motor Group",
        "Tesla"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_801"
      ],
      "companyDomains": [
        "hyundai.com",
        "tesla.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Electrek",
      "title": "Tesla’s European future in doubt, but they didn’t get banned in California!",
      "url": "https://electrek.co/2026/02/18/teslas-european-future-in-doubt-but-they-didnt-get-banned-in-california/",
      "desc": "On today’s labor-intensive episode of Quick Charge , Germany’s largest union IG Metall is squaring off with Tesla in a major dispute involving a toxic work culture, criminal charges, defamation, and more – but at least they can still sell cars in California (for now). more…",
      "hash": "6e546ecc5a2e9b021bddaa034807d8e3",
      "triggerNames": [
        "employee dispute & strike",
        "law suit/judgement/ settlement"
      ],
      "companyNames": [
        "Tesla"
      ],
      "triggerCodes": [
        "KW_677",
        "KW_526"
      ],
      "companyDomains": [
        "tesla.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Livemint",
      "title": "OpenAI to open new offices in Mumbai and Bengaluru as Sam Altman attends AI Impact Summit",
      "url": "https://www.livemint.com/companies/news/openai-to-open-new-offices-in-mumbai-and-bengaluru-as-sam-altman-attends-ai-impact-summit-11771471821695.html",
      "desc": "OpenAI is set to expand its presence in India with new offices in Mumbai and Bengaluru later this year, complementing its existing office in New Delhi opened last year.",
      "hash": "f38ee3bfa8be380891835ecfe268706e",
      "triggerNames": [
        "business expansion",
        "branch/store opening"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_640"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "126aaa8564dcbd3def8aa540215cad46",
          "title": "OpenAI plans offices in Mumbai, B'luru",
          "desc": "OpenAI plans new offices in Mumbai and Bengaluru.To be updated",
          "publisher": "The Economic Times",
          "url": "https://economictimes.indiatimes.com/tech/technology/openai-plans-new-offices-in-mumbai-and-bengaluru/articleshow/128538203.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "b6cc3018201796ab1a85e8127ace60fd",
          "title": "OpenAI plans new offices in Mumbai and Bengaluru",
          "desc": "OpenAI plans new offices in Mumbai and Bengaluru",
          "publisher": "The Economic Times",
          "url": "https://economictimes.indiatimes.com/tech/technology/openai-plans-new-offices-in-mumbai-and-bengaluru/articleshow/128538203.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "9fe38dce648b2e53cb36e533b8241aaa",
          "title": "OpenAI To Open New Offices In Mumbai & Bengaluru, To Expand Footprint Beyond New Delhi",
          "desc": "",
          "publisher": "Free Press Journal",
          "url": "https://www.freepressjournal.in/tech/ai-summit-2026-delhi-openai-sam-altman-new-mumbai-bengaluru-offices",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "f33d6113324181ce58f109e720dfb55b",
          "title": "OpenAI plans new offices in Mumbai and Bengaluru",
          "desc": "These offices by the Sam Altman-led OpenAI are in addition to the exisiting one in New Delhi. This expansion coincides with OpenAI becoming the first customer of Tata Consultancy Services’ new data centre business, starting with 100 megawatts of capacity as part of the $500 billion global Stargate AI infrastructure initiative.",
          "publisher": "The Economic Times",
          "url": "https://economictimes.indiatimes.com/tech/technology/openai-plans-new-offices-in-mumbai-and-bengaluru/articleshow/128538203.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "8fa4240e99f9db8ceaa0155ae4ce52fc",
          "title": "OpenAI plans new offices in Mumbai and Bengaluru",
          "desc": "These will be in addition to the artificial intelligence major’s existing office in New Delhi. The expansion comes as OpenAI becomes the first customer of Tata Consultancy Services’ new data centre business, beginning with 100 MW under the $500 billion global Stargate AI infrastructure initiative.",
          "publisher": "The Economic Times",
          "url": "https://economictimes.indiatimes.com/tech/technology/openai-plans-new-offices-in-mumbai-and-bengaluru/articleshow/128538203.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Techcrunch",
      "title": "OpenAI deepens India push with Pine Labs fintech partnership",
      "url": "https://techcrunch.com/2026/02/18/openai-deepens-india-push-with-pine-labs-fintech-partnership/",
      "desc": "OpenAI moves beyond ChatGPT in India with a Pine Labs deal targeting enterprise payments and AI-driven commerce.",
      "hash": "abfebc9aa9532ca41e1e1998c9a4f36c",
      "triggerNames": [
        "alliance & partnership",
        "business expansion"
      ],
      "companyNames": [
        "OpenAI",
        "Pine Labs"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_512"
      ],
      "companyDomains": [
        "openai.com",
        "pinelabs.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "f09d3492f59df0039047a317fc55e913",
          "title": "OpenAI’s ChatGPT joins hands with Pine Labs to enable agentic commerce",
          "desc": "With this integration, Pine Labs becomes OpenAI’s first payments partner for ChatGPT in India, allowing merchants on its network to process transactions initiated through AI-led interfaces.",
          "publisher": "The Economic Times",
          "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/openais-chatgpt-joins-hands-with-pine-labs-to-enable-agentic-commerce/articleshow/128537380.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "a8499a41edc78d29909bbf0f87da0f9b",
          "title": "Indian digital payments company Pine Labs plans to embed OpenAI APIs into its infrastructure to enable AI-assisted settlement, reconciliation, and invoicing (Jagmeet Singh/TechCrunch)",
          "desc": "Jagmeet Singh / TechCrunch : Indian digital payments company Pine Labs plans to embed OpenAI APIs into its infrastructure to enable AI-assisted settlement, reconciliation, and invoicing —  As India pitches itself as a global hub for applied artificial intelligence, OpenAI has partnered with Pine Labs to integrate AI-driven reasoning …",
          "publisher": "Techmeme",
          "url": "http://www.techmeme.com/260219/p4#a260219p4",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Livemint",
      "title": "Tata Group to roll out ChatGPT Enterprise across companies, ‘accelerate AI-native transformation’",
      "url": "https://www.livemint.com/companies/news/tata-group-to-roll-out-chatgpt-enterprise-across-companies-accelerate-ai-native-transformation-11771470415354.html",
      "desc": "Tata Group teams up with OpenAI to deploy ChatGPT Enterprise and expand data center capabilities. TCS will utilize OpenAI’s Codex for software development, marking a significant step in AI integration and transformation within the organization.",
      "hash": "b47bae24ac903494ae04805bf769f275",
      "triggerNames": [
        "alliance & partnership",
        "business expansion",
        "new service launch"
      ],
      "companyNames": [
        "Tata Group",
        "OpenAI",
        "Tata Consultancy Services (TCS)"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_512",
        "KW_566"
      ],
      "companyDomains": [
        "tata.com",
        "openai.com",
        "tcs.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "d6721af8f317709fd3dd5ee91165e9d2",
          "title": "Tata Group, OpenAI In Pact To Train Employees, Build Data Centre Capacity",
          "desc": "Under the pact, several thousand Tata Group employees will get access to enterprise ChatGPT to accelerate innovation and productivity.",
          "publisher": "NDTV",
          "url": "https://www.ndtvprofit.com/technology/tata-group-openai-in-pact-to-train-employees-build-data-centre-capacity-11056682#publisher=newsstand",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "282cdf211e43883121396f85a1cf466d",
          "title": "Tata’s data centre business signs up OpenAI as customer",
          "desc": "NEW DELHI: OpenAI will become the first customer of India’s Tata Consultancy Services’ data center business, beginning with 100 megawatts of capacity, the parent firm of ChatGPT said on Thursday. Separately, Tata Group is planning to deploy ChatGPT Enterprise across the company over the next several years, starting with hundreds of thousands of employees, OpenAI added.",
          "publisher": "Business Recorder",
          "url": "https://www.brecorder.com/news/40408024/tatas-data-centre-business-signs-up-openai-as-customer",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "f5a8607362177e7410b1c70776d2e8b8",
          "title": "Tata's data centre business signs up OpenAI as customer",
          "desc": "Separately, Tata Group is ​planning to deploy ​ChatGPT Enterprise across the company over the ‌next several years, starting ​with ​hundreds ⁠of thousands of employees, OpenAI added.",
          "publisher": "The Economic Times",
          "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/tatas-data-centre-business-signs-up-openai-as-customer/articleshow/128537473.cms",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "37117812ff9ecd20b2b25c58f6617227",
          "title": "Tata's data centre business signs up OpenAI as customer",
          "desc": "Separately, Tata Group is planning to deploy ChatGPT Enterprise across the company over the next several years, starting with hundreds ⁠of thousands of employees, OpenAI added.",
          "publisher": "Economic Times",
          "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/tatas-data-centre-business-signs-up-openai-as-customer/articleshow/128537473.cms",
          "publishDate": "2026-02-18T00:00:00.000Z"
        },
        {
          "hash": "86dbe28fc820f7327f4840061188598d",
          "title": "India's TCS ropes in OpenAI as first customer for data centre business",
          "desc": "Tata Group also plans to deploy ChatGPT Enterprise across the company over the next several years.",
          "publisher": "Deal Street Asia",
          "url": "https://www.dealstreetasia.com/stories/indias-tcs-ropes-in-openai-as-first-customer-for-data-centre-business-473358",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "82e35c2ab333f5ac2f521a430f1d772a",
          "title": "India's TCS signs OpenAI as its first data center customer, starting with 100MW of capacity; Tata Group plans to deploy ChatGPT Enterprise, starting with TCS (Jagmeet Singh/TechCrunch)",
          "desc": "Jagmeet Singh / TechCrunch : India's TCS signs OpenAI as its first data center customer, starting with 100MW of capacity; Tata Group plans to deploy ChatGPT Enterprise, starting with TCS —  OpenAI has partnered with India's Tata Group to secure 100 megawatts of AI-ready data center capacity in the country, with plans to scale to 1 gigawatt.",
          "publisher": "Techmeme",
          "url": "http://www.techmeme.com/260219/p2#a260219p2",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "The Economic Times",
      "title": "OpenAI funding on track to top $100 billion with latest round",
      "url": "https://economictimes.indiatimes.com/tech/funding/openai-funding-on-track-to-top-100-billion-with-latest-round/articleshow/128535613.cms",
      "desc": "As the ChatGPT maker prepares to spend trillions in infrastructure investment, the overall valuation of the company, including the eventual funding, could exceed $850 billion, according to some of the people. That’s higher than the $830 billion initially expected. The company’s pre-money value will remain $730 billion, said one person, all of whom asked not to be identified discussing private information.",
      "hash": "0daff9ae4687370987bf80dea78dcaf1",
      "triggerNames": [
        "fundraising",
        "business outlook & projections"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_688",
        "KW_514"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "2ba60cb7d12803cd2622612b2ca8c4aa",
          "title": "OpenAI’s New Funding Round Could Exceed $100 Billion",
          "desc": "OpenAI’s latest round of funding could reportedly value the startup at more than $850 billion.  The ChatGPT creator is close to concluding the initial phase of a new round of funding that is likely to take in upwards of $100 billion, Bloomberg News reported late Wednesday (Feb. 18), citing sources familiar with the matter. […] The post OpenAI’s New Funding Round Could Exceed $100 Billion appeared first on PYMNTS.com .",
          "publisher": "PYMNTS",
          "url": "https://www.pymnts.com/artificial-intelligence-2/2026/openais-new-funding-round-could-exceed-100-billion/",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "a35285dafda0602096005ff54f7d1e00",
          "title": "OpenAI reportedly finalizing $100B deal at more than $850B valuation",
          "desc": "OpenAI is reportedly getting close to closing a $100 billion deal, with backers including Amazon, Nvidia, SoftBank, and Microsoft. The deal would value the ChatGPT-maker at $850 billion.",
          "publisher": "Techcrunch",
          "url": "https://techcrunch.com/2026/02/19/openai-reportedly-finalizing-100b-deal-at-more-than-850b-valuation/",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Bloomberg Technology",
      "title": "OpenAI Funding on Track to Top $100 Billion With Latest Round",
      "url": "https://www.bloomberg.com/news/articles/2026-02-19/openai-funding-on-track-to-top-100-billion-with-latest-round",
      "desc": "OpenAI is close to finalizing the first phase of a new funding round that is likely to bring in more than $100 billion, according to people familiar with the matter, a record-breaking financing deal that would give the startup additional capital to build out its artificial intelligence tools.",
      "hash": "3927cff54fff664ec2ac841c31894c1d",
      "triggerNames": [
        "fundraising"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_514"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "1538d9beab597549ac770fd83d475467",
          "title": "Sources: OpenAI is close to finalizing the first phase of its $100B round; its overall valuation, including the eventual funding, could exceed $850B (Bloomberg)",
          "desc": "Bloomberg : Sources: OpenAI is close to finalizing the first phase of its $100B round; its overall valuation, including the eventual funding, could exceed $850B —  OpenAI is close to finalizing the first phase of a new funding round that is likely to bring in more than $100 billion …",
          "publisher": "Techmeme",
          "url": "http://www.techmeme.com/260218/p64#a260218p64",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "c1aeefa64ea9404756a84c6a4e439972",
          "title": "OpenAI Funding on Track to Top $100 Billion in Latest Round",
          "desc": "OpenAI is close to finalizing the first phase of a new funding round that is likely to bring in more than $100 billion, according to people familiar with the matter, a record-breaking financing deal that would give the startup additional capital to build out its artificial intelligence tools.",
          "publisher": "Bloomberg Technology",
          "url": "https://www.bloomberg.com/news/articles/2026-02-19/openai-funding-on-track-to-top-100-billion-with-latest-round",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "20644d1c5e140def3acd9f7a6c622172",
          "title": "OpenAI funding round on track to top $100 bln",
          "desc": "OpenAI funding round on track to top $100 bln- Bloomberg",
          "publisher": "Investing.com",
          "url": "https://www.investing.com/news/stock-market-news/openai-funding-round-on-track-to-top-100-bln-bloomberg-4512519",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "6f78a0e7d85c2199ae61091e09ee4dae",
          "title": "OpenAI funding on track to top $126 billion with latest round",
          "desc": "Overall valuation of the company, including the eventual funding, could exceed US$850 billion.",
          "publisher": "The Straits Times",
          "url": "https://www.straitstimes.com/business/companies-markets/openai-funding-on-track-to-top-126-billion-with-latest-round",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "b8d5553c554a7a0eeb82ecd6812e8e42",
          "title": "OpenAI funding on track to top $100B with latest round: report",
          "desc": "",
          "publisher": "Seeking Alpha",
          "url": "https://seekingalpha.com/news/4553709-openai-funding-on-track-to-top-100b-with-latest-round-report?utm_source=feed_news_all&utm_medium=referral&feed_item_type=news",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "87cc3b9ef09aa9880669b936ae55a183",
          "title": "OpenAI funding round on track to top $100 bln- Bloomberg By Investing.com",
          "desc": "OpenAI funding round on track to top $100 bln- Bloomberg",
          "publisher": "Investing.com",
          "url": "https://www.investing.com/news/stock-market-news/openai-funding-round-on-track-to-top-100-bln-bloomberg-4512519",
          "publishDate": "2026-02-19T00:00:00.000Z"
        },
        {
          "hash": "97eb4357804d0a527b9183b86c413280",
          "title": "OpenAI in Final Stages of $100 Billion Funding Round",
          "desc": "OpenAI is close to finalizing the first phase of a new funding round that is likely to bring in more than $100 billion, according to people familiar with the matter, a record-breaking financing deal that would give the startup additional capital to build out its artificial intelligence tools. Bloomberg's Annabelle Droulers reports. (Source: Bloomberg)",
          "publisher": "Bloomberg Technology",
          "url": "https://www.bloomberg.com/news/videos/2026-02-19/openai-in-final-stages-of-100-billion-funding-round-video",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "The Information",
      "title": "OpenAI Is Finalizing First Commitments for $100 Billion Mega Round",
      "url": "https://www.theinformation.com/articles/openai-finalizing-first-commitments-100-billion-mega-round",
      "desc": "OpenAI is finalizing initial commitments from investors in a round that could raise $100 billion at a $830 billion valuation including the investment , according to two people with direct knowledge of the fundraising. SoftBank is expected to anchor the round with a $30 billion investment, which it will spread in three installments of $10 billion each through the year, according to the two people. Amazon, which supplies cloud services to OpenAI, could invest as much as $50 billion; Nvidia, whose chips OpenAI’s models, could invest up to $30 billion; and long-standing partner Microsoft could invest in the low billions of dollars, according to one of the people.",
      "hash": "80181f99f1e2c892864f370b9c6ba17a",
      "triggerNames": [
        "fundraising"
      ],
      "companyNames": [
        "OpenAI",
        "SoftBank",
        "Amazon",
        "Nvidia",
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_514"
      ],
      "companyDomains": [
        "openai.com",
        "softbank.jp",
        "amazon.com",
        "nvidia.com",
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Cointelegraph",
      "title": "OpenAI pits AI agents against each other to red team smart contracts",
      "url": "https://cointelegraph.com/news/openai-benchmark-ai-agents-detect-smart-contract-flaws?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "desc": "OpenAI said it is becoming increasingly important to evaluate the performance of AI agents in “economically meaningful environments” as their adoption grows.",
      "hash": "26793a1b6f0b7129ddc4fd86f7bfc1c7",
      "triggerNames": [
        "experiments/trials/pilots",
        "new initiatives and programs"
      ],
      "companyNames": [
        "OpenAI"
      ],
      "triggerCodes": [
        "KW_801",
        "KW_802"
      ],
      "companyDomains": [
        "openai.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": [
        {
          "hash": "f51bdf4864b3eb1b4eba2eb9d1318cb6",
          "title": "OpenAI pits AI agents against each other to detect smart contract flaws",
          "desc": "OpenAI said it is becoming increasingly important to evaluate the performance of AI agents in “economically meaningful environments” as their adoption grows.",
          "publisher": "Cointelegraph",
          "url": "https://cointelegraph.com/news/openai-benchmark-ai-agents-detect-smart-contract-flaws?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "The Economic Times",
      "title": "AI is offering Global South a unique opportunity to catch up fast: Microsoft’s Brad Smith",
      "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/ai-is-offering-global-south-a-unique-opportunity-to-catch-up-fast-microsofts-brad-smith/articleshow/128523342.cms",
      "desc": "Brad Smith, Microsoft’s vice-chair, said AI gives the Global South a chance for “catch-up growth” as technology adoption and investment increase. He called India a “land of digital opportunity” and highlighted the company’s $17 billion-plus investment supporting the country’s $200 billion AI infrastructure push. Opportunities exist across infrastructure, platforms, and applications.",
      "hash": "81809beed5c7ac76a67999a0efac8e9d",
      "triggerNames": [
        "investment",
        "executive statement"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_583",
        "KW_708"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Financial Times",
      "title": "Is an AI price war about to begin?",
      "url": "https://www.ft.com/content/37c91e08-d13a-45a7-a3a7-acb43fa5522e",
      "desc": "Assumptions underpinning valuations of big US groups might be too optimistic",
      "hash": "2698d74913d04167154361dc39148b43",
      "triggerNames": [
        "pricing",
        "business outlook & projections"
      ],
      "companyNames": [
        "Alphabet Inc.",
        "Microsoft Corporation",
        "Amazon.com, Inc.",
        "Meta Platforms, Inc."
      ],
      "triggerCodes": [
        "KW_688",
        "KW_14"
      ],
      "companyDomains": [
        "abc.xyz",
        "microsoft.com",
        "amazon.com",
        "about.meta.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Globenewswire",
      "title": "Fortude further strengthens Microsoft cloud capabilities with Azure Infrastructure Solutions Designation",
      "url": "https://www.globenewswire.com/news-release/2026/02/19/3240736/0/en/Fortude-further-strengthens-Microsoft-cloud-capabilities-with-Azure-Infrastructure-Solutions-Designation.html",
      "desc": "Melbourne, Feb.  18, 2026  (GLOBE NEWSWIRE) -- Fortude , a global digital solutions provider, has earned the Microsoft Azure Infrastructure Solutions designation, further expanding its Microsoft cloud expertise and reinforcing its position as a trusted partner for enterprise-scale cloud transformation.",
      "hash": "87da2393fa2932fb9904d5250553c62b",
      "triggerNames": [
        "certification",
        "business expansion"
      ],
      "companyNames": [
        "Fortude",
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_527",
        "KW_610"
      ],
      "companyDomains": [
        "fortude.co",
        "microsoft.com"
      ],
      "publishDate": "2026-02-19",
      "similarNews": []
    },
    {
      "publisher": "Big News Network",
      "title": "Windows Admin Center Flaw Opens Door to Privilege Escalation",
      "url": "https://www.esecurityplanet.com/threats/windows-admin-center-flaw-opens-door-to-privilege-escalation/",
      "desc": "Windows Admin Center Flaw Opens Door to Privilege Escalation",
      "hash": "8654c6f00d13d54805c3f3ba03ac9593",
      "triggerNames": [
        "security breach & vulnerability"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_530"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-18",
      "similarNews": [
        {
          "hash": "b6a8ce17142167c3eb6a2a1712a8f41a",
          "title": "Microsoft: Critical Windows Admin Center Flaw Allows Privilege Escalation",
          "desc": "A high-severity Windows Admin Center vulnerability (CVE-2026-26119) could allow privilege escalation in enterprise environments. Here’s what to know and how to mitigate risk. The post Microsoft: Critical Windows Admin Center Flaw Allows Privilege Escalation appeared first on TechRepublic .",
          "publisher": "Tech Republic",
          "url": "https://www.techrepublic.com/article/news-windows-admin-center-privilege-escalation-february-2026/",
          "publishDate": "2026-02-19T00:00:00.000Z"
        }
      ]
    },
    {
      "publisher": "Big News Network",
      "title": "XSS Bug in VS Code Extension Exposed Local Files",
      "url": "https://www.esecurityplanet.com/threats/xss-bug-in-vs-code-extension-exposed-local-files/",
      "desc": "XSS Bug in VS Code Extension Exposed Local Files",
      "hash": "cb2505ed8eb2133713adb32acdfaf0c4",
      "triggerNames": [
        "security breach & vulnerability"
      ],
      "companyNames": [
        "Microsoft"
      ],
      "triggerCodes": [
        "KW_530"
      ],
      "companyDomains": [
        "microsoft.com"
      ],
      "publishDate": "2026-02-18",
      "similarNews": []
    },
    {
      "publisher": "Tech Radar",
      "title": "'AI assistants are no longer just productivity tools; they are becoming part of the infrastructure that malware can abuse': Experts warn Copilot and Grok can be hijacked to spread malware",
      "url": "https://www.techradar.com/pro/security/ai-assistants-like-copilot-and-grok-can-be-hijacked-to-spread-malware-experts-warn-heres-how-to-stay-safe",
      "desc": "Malware can blend in with legitimate AI traffic using popular AI tools as C2 infrastructure.",
      "hash": "98e532294aaed9e7d157ad2bae93ecd9",
      "triggerNames": [
        "security breach & vulnerability"
      ],
      "companyNames": [
        "Microsoft Copilot",
        "Grok"
      ],
      "triggerCodes": [
        "KW_530"
      ],
      "companyDomains": [
        "copilot.microsoft.com",
        "x.ai"
      ],
      "publishDate": "2026-02-18",
      "similarNews": []
    },
    {
      "publisher": "Jalopnik",
      "title": "Tesla Claims It's Already Built A Cybercab On The Production Line",
      "url": "https://www.jalopnik.com/2104801/tesla-claims-its-built-cybercab-production-line/",
      "desc": "Maybe Tesla made exactly one car well before the others just so its boss could win a bet with MKBHD. Stranger things have certainly happened at Tesla.",
      "hash": "e8abcfb57b14682030be9964436f483e",
      "triggerNames": [
        "new product launch"
      ],
      "companyNames": [
        "Tesla"
      ],
      "triggerCodes": [
        "KW_521"
      ],
      "companyDomains": [
        "tesla.com"
      ],
      "publishDate": "2026-02-18",
      "similarNews": []
    },
    {
      "publisher": "Asahi",
      "title": "Will Tesla cease to be an EV company? The core",
      "url": "http://www.asahi.com/articles/ASV2L165DV2LUHBI002M.html?ref=rss",
      "desc": "is AI, Musk says 'mission updated'.",
      "hash": "2d324fb98e117c7a1ae7c39a8490aed0",
      "triggerNames": [
        "executive statement",
        "business outlook & projections"
      ],
      "companyNames": [
        "Tesla, Inc."
      ],
      "triggerCodes": [
        "KW_583",
        "KW_688"
      ],
      "companyDomains": [
        "tesla.com"
      ],
      "publishDate": "2026-02-18",
      "similarNews": []
    }
  ]
}